#ifndef UE4SS_SDK_ABP_B2_Tora_HPP
#define UE4SS_SDK_ABP_B2_Tora_HPP

class UABP_B2_Tora_C : public UCDAIAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0350 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0358 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x0388 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x03B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x03D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x0400 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x0428 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x0450 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x0478 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x04A0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x04C8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x0548 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x0578 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x05F8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x0628 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x06A8 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x0748 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x07C8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x07F8 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x08A8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x08D8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x0958 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x0988 (size: 0xB0)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x0A38 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x0A80 (size: 0xC0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x0B40 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x0C98 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x0CC0 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x0CE8 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x0D30 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x0D78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x0DA0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x0DC8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x0E48 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x0E78 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x0EF8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x0F28 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x0FA8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x0FD8 (size: 0xB0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x1088 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x1128 (size: 0xA0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x11C8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x11F0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x1270 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x12A0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x1320 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x1350 (size: 0xB0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x1400 (size: 0xA0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x14A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x14C8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x14F0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x1570 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x15A0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x1620 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x1650 (size: 0xB0)
    class ACDAICharacter* Pawn;                                                       // 0x1700 (size: 0x8)
    bool Turn_L;                                                                      // 0x1708 (size: 0x1)
    bool Turn_R;                                                                      // 0x1709 (size: 0x1)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_B2_Tora_AnimGraphNode_SequencePlayer_7B208601491C7F4D60FB2B8F0E66644F();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_B2_Tora_AnimGraphNode_TransitionResult_E812483E4AC6DF3B644CA9B631AF53E1();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_B2_Tora_AnimGraphNode_SequencePlayer_79CC1B01432DB3F60FF9C5A10D64486E();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void ExecuteUbergraph_ABP_B2_Tora(int32 EntryPoint);
}; // Size: 0x170A

#endif
