#ifndef UE4SS_SDK_AnimBP_Player_HPP
#define UE4SS_SDK_AnimBP_Player_HPP

class UAnimBP_Player_C : public UCDPlayerAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0BB0 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root_2;                                              // 0x0BB8 (size: 0x30)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_1;                        // 0x0BE8 (size: 0x118)
    FAnimNode_Root AnimGraphNode_Root_1;                                              // 0x0D00 (size: 0x30)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x0D30 (size: 0x118)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0E48 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x0E78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x0EA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x0EC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x0EF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x0F18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x0F40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x0F68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x0F90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x0FB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x0FE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x1008 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x1030 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x1058 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x1080 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x10A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x10D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x10F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x1120 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x1148 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x1170 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x11F0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x1220 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x12A0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x12D0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x1350 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x1380 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x1400 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x1430 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x14B0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x14E0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x1560 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x1590 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x1610 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x1640 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x16C0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x16F0 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15;                         // 0x17A0 (size: 0x158)
    FAnimNode_Slot AnimGraphNode_Slot_7;                                              // 0x18F8 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14;                         // 0x1940 (size: 0x158)
    FAnimNode_Slot AnimGraphNode_Slot_6;                                              // 0x1A98 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13;                         // 0x1AE0 (size: 0x158)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x1C38 (size: 0xC0)
    FAnimNode_Slot AnimGraphNode_Slot_5;                                              // 0x1CF8 (size: 0x48)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2;          // 0x1D40 (size: 0xD0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23;                           // 0x1E10 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22;                           // 0x1E38 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21;                           // 0x1E60 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20;                           // 0x1E88 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x1EB0 (size: 0xA0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12;                         // 0x1F50 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11;                         // 0x20A8 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19;                           // 0x2200 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18;                           // 0x2228 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x2250 (size: 0xA0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10;                         // 0x22F0 (size: 0x158)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_1;          // 0x2448 (size: 0xD0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x2518 (size: 0x80)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9;                          // 0x2598 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17;                           // 0x26F0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x2718 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x2740 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8;                          // 0x2768 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x28C0 (size: 0x28)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x28E8 (size: 0xD0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x29B8 (size: 0x80)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x2A38 (size: 0xE8)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x2B20 (size: 0x190)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7;                          // 0x2CB0 (size: 0x158)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x2E08 (size: 0xC0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x2EC8 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x2F48 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x2F70 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x2FB8 (size: 0x80)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_1;                                    // 0x3040 (size: 0x1E0)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x3220 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x3240 (size: 0x20)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK;                                      // 0x3260 (size: 0x1E0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x3440 (size: 0x108)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6;                          // 0x3548 (size: 0x158)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x36A0 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x3760 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x3788 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x37B0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x37D8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x3800 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x3830 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x38B0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x38E0 (size: 0xB0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x3990 (size: 0xA0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0x3A30 (size: 0x158)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x3B88 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x3BD0 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x3BF8 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x3C40 (size: 0xC0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x3D00 (size: 0x158)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x3E58 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x3EA0 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x3FF8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x4020 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x40A0 (size: 0xA0)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_1;                        // 0x4140 (size: 0xB0)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve;                                  // 0x41F0 (size: 0x58)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer;                          // 0x4248 (size: 0xB0)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x42F8 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x4340 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x4400 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x4428 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x4580 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x45A8 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x45D0 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x4690 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x46B8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x46E0 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x4708 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x4860 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x4888 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x48B0 (size: 0xC0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x4970 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x4AC8 (size: 0x28)
    float CameraBlend;                                                                // 0x4AF0 (size: 0x4)
    float Rotation Z (Yaw);                                                           // 0x4AF4 (size: 0x4)
    FVector LeftEffector;                                                             // 0x4AF8 (size: 0xC)
    FVector RightEffector;                                                            // 0x4B04 (size: 0xC)
    float HandDistance;                                                               // 0x4B10 (size: 0x4)

    void WeaponFireLayer(FPoseLink InPose, FPoseLink& WeaponFireLayer);
    void LeftArmLayer(FPoseLink InPose, FPoseLink& LeftArmLayer);
    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_BlendListByBool_3D969DEA4144B70E9AE52EBD7848D971();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_ModifyBone_5A0429DB40D4E12E2BFCFDB3251175CD();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TwoBoneIK_1AD0E6544E9A49626179EDA113E1EE8D();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TwoBoneIK_468D8AE145FCE36B48340BB7EA863940();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_LayeredBoneBlend_9AB4FE1D48DA222FC9431496B219C34F();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_BlendListByBool_43C917FB4274790C9D987291EAF68F82();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TransitionResult_8449B9274833E1AE3FAE8EBF4A68CD13();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TransitionResult_515EC63E4E9F93D6B2E3E58612233E82();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TransitionResult_AC6D45F747C9907F2C7B53A028E0D214();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TransitionResult_731210CB4A4FC669F78374BDAE29D86A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TransitionResult_D5680B344AEB988B19BB4981A27ACFBE();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TransitionResult_147C242947C26D710DDD29B6FD0054EC();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TransitionResult_EA5BCA4141AD2A6D27BFA88BAAA47132();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TransitionResult_BCEABA1A458E1AB04D2A38A876A7E0A9();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TransitionResult_E9397D594C97E9CE5EE26487E1DDDFDA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TransitionResult_827A898440420B90400F119E28772BDE();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TransitionResult_9343952C43A245CC974AF482EDA9272E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TransitionResult_13272F41428ABE9F6B2125AD80A96638();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TransitionResult_E5B3D5C643346ABCC21EB8B69674D803();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TransitionResult_C6A9F0EA46E0985CB08E4F8EE66340F4();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TransitionResult_BB45A9DE4B2968C36A7D54BE1B1A861E();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void ExecuteUbergraph_AnimBP_Player(int32 EntryPoint);
}; // Size: 0x4B14

#endif
