#ifndef UE4SS_SDK_AnimBP_Detonator_HPP
#define UE4SS_SDK_AnimBP_Detonator_HPP

class UAnimBP_Detonator_C : public UCDLeftArmActorAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0BB0 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0BB8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x0BE8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x0C10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x0C38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x0C60 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x0C88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x0CB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x0CD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x0D00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x0D28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x0D50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x0D78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x0DA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x0DC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x0DF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x0E18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x0E40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x0E68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x0E90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0EB8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x0EE0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x0F60 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x0F90 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x1010 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x1040 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x10C0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x10F0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x1170 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x11A0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x1220 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x1250 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x12D0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x1300 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x1380 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x13B0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x1430 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x1460 (size: 0xB0)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x1510 (size: 0x48)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Detonator_AnimGraphNode_TransitionResult_6C6506A244C71841695F649FBDC263C8();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Detonator_AnimGraphNode_TransitionResult_674978BC4C8F0943EA8CC996A4137328();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Detonator_AnimGraphNode_TransitionResult_4764A8C74463ADD6801A9E801D9C7C58();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Detonator_AnimGraphNode_TransitionResult_75B561B24288619BEB8E9F83C7BE6D9E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Detonator_AnimGraphNode_TransitionResult_E749EC3D4B115E46CC5799A150CE1E6C();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Detonator_AnimGraphNode_TransitionResult_3B38351E4508B3DAF2C1399F4C7D3408();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Detonator_AnimGraphNode_TransitionResult_E58944DE4E9CEC18C2229A82B3BB37DB();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Detonator_AnimGraphNode_TransitionResult_B3F5F744484B950BB088CF848D07F1BD();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Detonator_AnimGraphNode_TransitionResult_7D6594004CFD4C655E5E779E7116E8DE();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Detonator_AnimGraphNode_TransitionResult_5F1532734C81551CFBD8F3A5EE8A7490();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Detonator_AnimGraphNode_TransitionResult_99581AE241C77D27E300A0B964CC2B25();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Detonator_AnimGraphNode_TransitionResult_AB73A61C4288A773000FD7B335F6D4BE();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Detonator_AnimGraphNode_TransitionResult_F64CEDEA49E88A43860D2F88EC358391();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Detonator_AnimGraphNode_TransitionResult_AC44FD62486D40915F3DB491A1DB630B();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Detonator_AnimGraphNode_TransitionResult_7A89435F4A167B7562FF249EC606E117();
    void ExecuteUbergraph_AnimBP_Detonator(int32 EntryPoint);
}; // Size: 0x1558

#endif
