#ifndef UE4SS_SDK_AnimBP_Taser_HPP
#define UE4SS_SDK_AnimBP_Taser_HPP

class UAnimBP_Taser_C : public UCDTaserAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0BA0 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0BA8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x0BD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x0C00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x0C28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x0C50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x0C78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x0CA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x0CC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x0CF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x0D18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x0D40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x0D68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x0D90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x0DB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x0DE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x0E08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x0E30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x0E58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x0E80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0EA8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x0ED0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x0F50 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x0F80 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x1000 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x1030 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x10B0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x10E0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x1160 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x1190 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x1210 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x1240 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x12C0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x12F0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x1370 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x13A0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x1420 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x1450 (size: 0xB0)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x1500 (size: 0x48)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Taser_AnimGraphNode_TransitionResult_7420FB414DCF66274AF349BF4A6BA7F7();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Taser_AnimGraphNode_TransitionResult_FA762F194A72210F543F338E6C152FC4();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Taser_AnimGraphNode_TransitionResult_D2AC9B15410AC3B0E4EFF6BF47480B93();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Taser_AnimGraphNode_TransitionResult_E938F51C46512BE026D528BBB77D3AFA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Taser_AnimGraphNode_TransitionResult_9940B151462C9A1D08A079831E3FBD7F();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Taser_AnimGraphNode_TransitionResult_BC52C84349BCCA0B86F9C6BB7618927E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Taser_AnimGraphNode_TransitionResult_B2D0E1EA420F98F18EB23B9AA164B0DE();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Taser_AnimGraphNode_TransitionResult_31EB365848B44972CD7BFEBDDC15AF91();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Taser_AnimGraphNode_TransitionResult_B594875D4B86E20FAE7BC0AEF532073C();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Taser_AnimGraphNode_TransitionResult_4899B0CB4C74660728EF8EBC25063558();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Taser_AnimGraphNode_TransitionResult_CDB8B13D435B95691792DBA3031F1035();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Taser_AnimGraphNode_TransitionResult_394C35C74A0007A0861E38AA42667D9E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Taser_AnimGraphNode_TransitionResult_4DD152B54C1206141ED9FABC84B2F99A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Taser_AnimGraphNode_TransitionResult_69E130E94B00E114C8288B8173F32975();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Taser_AnimGraphNode_TransitionResult_500FC541477966126BAE7C9B3CB41832();
    void ExecuteUbergraph_AnimBP_Taser(int32 EntryPoint);
}; // Size: 0x1548

#endif
