#ifndef UE4SS_SDK_PlayFab_HPP
#define UE4SS_SDK_PlayFab_HPP

#include "PlayFab_enums.hpp"

struct FAdminAbortTaskInstanceRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString TaskInstanceId;                                                           // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAdminAddLocalizedNewsRequest : public FPlayFabRequestCommon
{
    FString Body;                                                                     // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    FString Language;                                                                 // 0x0020 (size: 0x10)
    FString NewsId;                                                                   // 0x0030 (size: 0x10)
    FString Title;                                                                    // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FAdminAddLocalizedNewsResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminAddNewsRequest : public FPlayFabRequestCommon
{
    FString Body;                                                                     // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    FString Timestamp;                                                                // 0x0020 (size: 0x10)
    FString Title;                                                                    // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FAdminAddNewsResult : public FPlayFabResultCommon
{
    FString NewsId;                                                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminAddPlayerTagRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString PlayFabId;                                                                // 0x0010 (size: 0x10)
    FString TagName;                                                                  // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FAdminAddPlayerTagResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminAddServerBuildRequest : public FPlayFabRequestCommon
{
    FString ActiveRegions;                                                            // 0x0008 (size: 0x10)
    FString BuildId;                                                                  // 0x0018 (size: 0x10)
    FString CommandLineTemplate;                                                      // 0x0028 (size: 0x10)
    FString Comment;                                                                  // 0x0038 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0048 (size: 0x8)
    FString ExecutablePath;                                                           // 0x0050 (size: 0x10)
    int32 MaxGamesPerHost;                                                            // 0x0060 (size: 0x4)
    int32 MinFreeGameSlots;                                                           // 0x0064 (size: 0x4)

}; // Size: 0x68

struct FAdminAddServerBuildResult : public FPlayFabResultCommon
{
    FString ActiveRegions;                                                            // 0x0008 (size: 0x10)
    FString BuildId;                                                                  // 0x0018 (size: 0x10)
    FString CommandLineTemplate;                                                      // 0x0028 (size: 0x10)
    FString Comment;                                                                  // 0x0038 (size: 0x10)
    FString ExecutablePath;                                                           // 0x0048 (size: 0x10)
    int32 MaxGamesPerHost;                                                            // 0x0058 (size: 0x4)
    int32 MinFreeGameSlots;                                                           // 0x005C (size: 0x4)
    EGameBuildStatus Status;                                                          // 0x0060 (size: 0x1)
    FString Timestamp;                                                                // 0x0068 (size: 0x10)
    FString TitleId;                                                                  // 0x0078 (size: 0x10)

}; // Size: 0x88

struct FAdminAddUserVirtualCurrencyRequest : public FPlayFabRequestCommon
{
    int32 Amount;                                                                     // 0x0008 (size: 0x4)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    FString PlayFabId;                                                                // 0x0018 (size: 0x10)
    FString VirtualCurrency;                                                          // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FAdminAddVirtualCurrencyTypesRequest : public FPlayFabRequestCommon
{
    TArray<class UPlayFabJsonObject*> VirtualCurrencies;                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminBanUsersRequest : public FPlayFabRequestCommon
{
    TArray<class UPlayFabJsonObject*> Bans;                                           // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FAdminBanUsersResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> BanData;                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminBlankResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminCheckLimitedEditionItemAvailabilityRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    FString ItemId;                                                                   // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FAdminCheckLimitedEditionItemAvailabilityResult : public FPlayFabResultCommon
{
    int32 Amount;                                                                     // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FAdminCreateActionsOnPlayerSegmentTaskRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString Description;                                                              // 0x0010 (size: 0x10)
    bool IsActive;                                                                    // 0x0020 (size: 0x1)
    FString Name;                                                                     // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* Parameter;                                              // 0x0038 (size: 0x8)
    FString Schedule;                                                                 // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FAdminCreateCloudScriptTaskRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString Description;                                                              // 0x0010 (size: 0x10)
    bool IsActive;                                                                    // 0x0020 (size: 0x1)
    FString Name;                                                                     // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* Parameter;                                              // 0x0038 (size: 0x8)
    FString Schedule;                                                                 // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FAdminCreateInsightsScheduledScalingTaskRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString Description;                                                              // 0x0010 (size: 0x10)
    bool IsActive;                                                                    // 0x0020 (size: 0x1)
    FString Name;                                                                     // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* Parameter;                                              // 0x0038 (size: 0x8)
    FString Schedule;                                                                 // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FAdminCreateOpenIdConnectionRequest : public FPlayFabRequestCommon
{
    FString ClientId;                                                                 // 0x0008 (size: 0x10)
    FString ClientSecret;                                                             // 0x0018 (size: 0x10)
    FString ConnectionId;                                                             // 0x0028 (size: 0x10)
    bool IgnoreNonce;                                                                 // 0x0038 (size: 0x1)
    FString IssuerDiscoveryUrl;                                                       // 0x0040 (size: 0x10)
    class UPlayFabJsonObject* IssuerInformation;                                      // 0x0050 (size: 0x8)

}; // Size: 0x58

struct FAdminCreatePlayerSharedSecretRequest : public FPlayFabRequestCommon
{
    FString FriendlyName;                                                             // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminCreatePlayerSharedSecretResult : public FPlayFabResultCommon
{
    FString SecretKey;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminCreatePlayerStatisticDefinitionRequest : public FPlayFabRequestCommon
{
    EStatisticAggregationMethod AggregationMethod;                                    // 0x0008 (size: 0x1)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    FString StatisticName;                                                            // 0x0018 (size: 0x10)
    EStatisticResetIntervalOption VersionChangeInterval;                              // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FAdminCreatePlayerStatisticDefinitionResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Statistic;                                              // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAdminCreateSegmentRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* SegmentModel;                                           // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAdminCreateSegmentResponse : public FPlayFabResultCommon
{
    FString ErrorMessage;                                                             // 0x0008 (size: 0x10)
    FString SegmentId;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FAdminCreateTaskResult : public FPlayFabResultCommon
{
    FString TaskId;                                                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminDeleteContentRequest : public FPlayFabRequestCommon
{
    FString Key;                                                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminDeleteMasterPlayerAccountRequest : public FPlayFabRequestCommon
{
    FString MetaData;                                                                 // 0x0008 (size: 0x10)
    FString PlayFabId;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FAdminDeleteMasterPlayerAccountResult : public FPlayFabResultCommon
{
    FString JobReceiptId;                                                             // 0x0008 (size: 0x10)
    FString TitleIds;                                                                 // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FAdminDeleteOpenIdConnectionRequest : public FPlayFabRequestCommon
{
    FString ConnectionId;                                                             // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminDeletePlayerRequest : public FPlayFabRequestCommon
{
    FString PlayFabId;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminDeletePlayerResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminDeletePlayerSharedSecretRequest : public FPlayFabRequestCommon
{
    FString SecretKey;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminDeletePlayerSharedSecretResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminDeleteSegmentRequest : public FPlayFabRequestCommon
{
    FString SegmentId;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminDeleteSegmentsResponse : public FPlayFabResultCommon
{
    FString ErrorMessage;                                                             // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminDeleteStoreRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    FString StoreId;                                                                  // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FAdminDeleteStoreResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminDeleteTaskRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* Identifier;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAdminDeleteTitleDataOverrideRequest : public FPlayFabRequestCommon
{
    FString OverrideLabel;                                                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminDeleteTitleDataOverrideResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminDeleteTitleRequest : public FPlayFabRequestCommon
{
}; // Size: 0x8

struct FAdminDeleteTitleResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminEmptyResponse : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminExportMasterPlayerDataRequest : public FPlayFabRequestCommon
{
    FString PlayFabId;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminExportMasterPlayerDataResult : public FPlayFabResultCommon
{
    FString JobReceiptId;                                                             // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetActionsOnPlayersInSegmentTaskInstanceResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Parameter;                                              // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Summary;                                                // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FAdminGetAllSegmentsRequest : public FPlayFabRequestCommon
{
}; // Size: 0x8

struct FAdminGetAllSegmentsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Segments;                                       // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetCatalogItemsRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetCatalogItemsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Catalog;                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetCloudScriptRevisionRequest : public FPlayFabRequestCommon
{
    int32 Revision;                                                                   // 0x0008 (size: 0x4)
    int32 Version;                                                                    // 0x000C (size: 0x4)

}; // Size: 0x10

struct FAdminGetCloudScriptRevisionResult : public FPlayFabResultCommon
{
    FString CreatedAt;                                                                // 0x0008 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Files;                                          // 0x0018 (size: 0x10)
    bool IsPublished;                                                                 // 0x0028 (size: 0x1)
    int32 Revision;                                                                   // 0x002C (size: 0x4)
    int32 Version;                                                                    // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FAdminGetCloudScriptTaskInstanceResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Parameter;                                              // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Summary;                                                // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FAdminGetCloudScriptVersionsRequest : public FPlayFabRequestCommon
{
}; // Size: 0x8

struct FAdminGetCloudScriptVersionsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Versions;                                       // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetContentListRequest : public FPlayFabRequestCommon
{
    FString Prefix;                                                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetContentListResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Contents;                                       // 0x0008 (size: 0x10)
    int32 ItemCount;                                                                  // 0x0018 (size: 0x4)
    int32 TotalSize;                                                                  // 0x001C (size: 0x4)

}; // Size: 0x20

struct FAdminGetContentUploadUrlRequest : public FPlayFabRequestCommon
{
    FString ContentType;                                                              // 0x0008 (size: 0x10)
    FString Key;                                                                      // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FAdminGetContentUploadUrlResult : public FPlayFabResultCommon
{
    FString URL;                                                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetDataReportRequest : public FPlayFabRequestCommon
{
    int32 Day;                                                                        // 0x0008 (size: 0x4)
    int32 Month;                                                                      // 0x000C (size: 0x4)
    FString ReportName;                                                               // 0x0010 (size: 0x10)
    int32 Year;                                                                       // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FAdminGetDataReportResult : public FPlayFabResultCommon
{
    FString DownloadUrl;                                                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetMatchmakerGameInfoRequest : public FPlayFabRequestCommon
{
    FString LobbyId;                                                                  // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetMatchmakerGameInfoResult : public FPlayFabResultCommon
{
    FString BuildVersion;                                                             // 0x0008 (size: 0x10)
    FString EndTime;                                                                  // 0x0018 (size: 0x10)
    FString LobbyId;                                                                  // 0x0028 (size: 0x10)
    FString Mode;                                                                     // 0x0038 (size: 0x10)
    FString Players;                                                                  // 0x0048 (size: 0x10)
    ERegion Region;                                                                   // 0x0058 (size: 0x1)
    FString ServerIPV4Address;                                                        // 0x0060 (size: 0x10)
    FString ServerIPV6Address;                                                        // 0x0070 (size: 0x10)
    int32 ServerPort;                                                                 // 0x0080 (size: 0x4)
    FString ServerPublicDNSName;                                                      // 0x0088 (size: 0x10)
    FString StartTime;                                                                // 0x0098 (size: 0x10)
    FString TitleId;                                                                  // 0x00A8 (size: 0x10)

}; // Size: 0xB8

struct FAdminGetMatchmakerGameModesRequest : public FPlayFabRequestCommon
{
    FString BuildVersion;                                                             // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetMatchmakerGameModesResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> GameModes;                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetPlayedTitleListRequest : public FPlayFabRequestCommon
{
    FString PlayFabId;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetPlayedTitleListResult : public FPlayFabResultCommon
{
    FString TitleIds;                                                                 // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetPlayerIdFromAuthTokenRequest : public FPlayFabRequestCommon
{
    FString Token;                                                                    // 0x0008 (size: 0x10)
    EAuthTokenType TokenType;                                                         // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FAdminGetPlayerIdFromAuthTokenResult : public FPlayFabResultCommon
{
    FString PlayFabId;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetPlayerProfileRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString PlayFabId;                                                                // 0x0010 (size: 0x10)
    class UPlayFabJsonObject* ProfileConstraints;                                     // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FAdminGetPlayerProfileResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* PlayerProfile;                                          // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAdminGetPlayerSegmentsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Segments;                                       // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetPlayerSharedSecretsRequest : public FPlayFabRequestCommon
{
}; // Size: 0x8

struct FAdminGetPlayerSharedSecretsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> SharedSecrets;                                  // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetPlayerStatisticDefinitionsRequest : public FPlayFabRequestCommon
{
}; // Size: 0x8

struct FAdminGetPlayerStatisticDefinitionsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Statistics;                                     // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetPlayerStatisticVersionsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString StatisticName;                                                            // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAdminGetPlayerStatisticVersionsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> StatisticVersions;                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetPlayerTagsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString Namespace;                                                                // 0x0010 (size: 0x10)
    FString PlayFabId;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FAdminGetPlayerTagsResult : public FPlayFabResultCommon
{
    FString PlayFabId;                                                                // 0x0008 (size: 0x10)
    FString Tags;                                                                     // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FAdminGetPlayersInSegmentRequest : public FPlayFabRequestCommon
{
    FString ContinuationToken;                                                        // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    int32 MaxBatchSize;                                                               // 0x0020 (size: 0x4)
    int32 SecondsToLive;                                                              // 0x0024 (size: 0x4)
    FString SegmentId;                                                                // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FAdminGetPlayersInSegmentResult : public FPlayFabResultCommon
{
    FString ContinuationToken;                                                        // 0x0008 (size: 0x10)
    TArray<class UPlayFabJsonObject*> PlayerProfiles;                                 // 0x0018 (size: 0x10)
    int32 ProfilesInSegment;                                                          // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FAdminGetPlayersSegmentsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString PlayFabId;                                                                // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAdminGetPolicyRequest : public FPlayFabRequestCommon
{
    FString PolicyName;                                                               // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetPolicyResponse : public FPlayFabResultCommon
{
    FString PolicyName;                                                               // 0x0008 (size: 0x10)
    int32 PolicyVersion;                                                              // 0x0018 (size: 0x4)
    TArray<class UPlayFabJsonObject*> Statements;                                     // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FAdminGetPublisherDataRequest : public FPlayFabRequestCommon
{
    FString Keys;                                                                     // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetPublisherDataResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Data;                                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAdminGetRandomResultTablesRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetRandomResultTablesResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Tables;                                                 // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAdminGetSegmentsRequest : public FPlayFabRequestCommon
{
    FString SegmentIds;                                                               // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetSegmentsResponse : public FPlayFabResultCommon
{
    FString ErrorMessage;                                                             // 0x0008 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Segments;                                       // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FAdminGetServerBuildInfoRequest : public FPlayFabRequestCommon
{
    FString BuildId;                                                                  // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetServerBuildInfoResult : public FPlayFabResultCommon
{
    FString ActiveRegions;                                                            // 0x0008 (size: 0x10)
    FString BuildId;                                                                  // 0x0018 (size: 0x10)
    FString Comment;                                                                  // 0x0028 (size: 0x10)
    FString ErrorMessage;                                                             // 0x0038 (size: 0x10)
    int32 MaxGamesPerHost;                                                            // 0x0048 (size: 0x4)
    int32 MinFreeGameSlots;                                                           // 0x004C (size: 0x4)
    EGameBuildStatus Status;                                                          // 0x0050 (size: 0x1)
    FString Timestamp;                                                                // 0x0058 (size: 0x10)
    FString TitleId;                                                                  // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FAdminGetServerBuildUploadURLRequest : public FPlayFabRequestCommon
{
    FString BuildId;                                                                  // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetServerBuildUploadURLResult : public FPlayFabResultCommon
{
    FString URL;                                                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetStoreItemsRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    FString StoreId;                                                                  // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FAdminGetStoreItemsResult : public FPlayFabResultCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* MarketingData;                                          // 0x0018 (size: 0x8)
    EPfSourceType Source;                                                             // 0x0020 (size: 0x1)
    TArray<class UPlayFabJsonObject*> Store;                                          // 0x0028 (size: 0x10)
    FString StoreId;                                                                  // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FAdminGetTaskInstanceRequest : public FPlayFabRequestCommon
{
    FString TaskInstanceId;                                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetTaskInstancesRequest : public FPlayFabRequestCommon
{
    FString StartedAtRangeFrom;                                                       // 0x0008 (size: 0x10)
    FString StartedAtRangeTo;                                                         // 0x0018 (size: 0x10)
    ETaskInstanceStatus StatusFilter;                                                 // 0x0028 (size: 0x1)
    class UPlayFabJsonObject* TaskIdentifier;                                         // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FAdminGetTaskInstancesResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Summaries;                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetTasksRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* Identifier;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAdminGetTasksResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Tasks;                                          // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetTitleDataRequest : public FPlayFabRequestCommon
{
    FString Keys;                                                                     // 0x0008 (size: 0x10)
    FString OverrideLabel;                                                            // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FAdminGetTitleDataResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Data;                                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAdminGetUserBansRequest : public FPlayFabRequestCommon
{
    FString PlayFabId;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetUserBansResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> BanData;                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminGetUserDataRequest : public FPlayFabRequestCommon
{
    int32 IfChangedFromDataVersion;                                                   // 0x0008 (size: 0x4)
    FString Keys;                                                                     // 0x0010 (size: 0x10)
    FString PlayFabId;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FAdminGetUserDataResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Data;                                                   // 0x0008 (size: 0x8)
    int32 DataVersion;                                                                // 0x0010 (size: 0x4)
    FString PlayFabId;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FAdminGetUserInventoryRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString PlayFabId;                                                                // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAdminGetUserInventoryResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Inventory;                                      // 0x0008 (size: 0x10)
    FString PlayFabId;                                                                // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* VirtualCurrency;                                        // 0x0028 (size: 0x8)
    class UPlayFabJsonObject* VirtualCurrencyRechargeTimes;                           // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FAdminGrantItemsToUsersRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    TArray<class UPlayFabJsonObject*> ItemGrants;                                     // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FAdminGrantItemsToUsersResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> ItemGrantResults;                               // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminIncrementLimitedEditionItemAvailabilityRequest : public FPlayFabRequestCommon
{
    int32 Amount;                                                                     // 0x0008 (size: 0x4)
    FString CatalogVersion;                                                           // 0x0010 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0020 (size: 0x8)
    FString ItemId;                                                                   // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FAdminIncrementLimitedEditionItemAvailabilityResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminIncrementPlayerStatisticVersionRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString StatisticName;                                                            // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAdminIncrementPlayerStatisticVersionResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* StatisticVersion;                                       // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAdminListBuildsRequest : public FPlayFabRequestCommon
{
}; // Size: 0x8

struct FAdminListBuildsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Builds;                                         // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminListOpenIdConnectionRequest : public FPlayFabRequestCommon
{
}; // Size: 0x8

struct FAdminListOpenIdConnectionResponse : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Connections;                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminListVirtualCurrencyTypesRequest : public FPlayFabRequestCommon
{
}; // Size: 0x8

struct FAdminListVirtualCurrencyTypesResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> VirtualCurrencies;                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminLookupUserAccountInfoRequest : public FPlayFabRequestCommon
{
    FString Email;                                                                    // 0x0008 (size: 0x10)
    FString PlayFabId;                                                                // 0x0018 (size: 0x10)
    FString TitleDisplayName;                                                         // 0x0028 (size: 0x10)
    FString Username;                                                                 // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FAdminLookupUserAccountInfoResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* UserInfo;                                               // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAdminModifyMatchmakerGameModesRequest : public FPlayFabRequestCommon
{
    FString BuildVersion;                                                             // 0x0008 (size: 0x10)
    TArray<class UPlayFabJsonObject*> GameModes;                                      // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FAdminModifyMatchmakerGameModesResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminModifyServerBuildRequest : public FPlayFabRequestCommon
{
    FString ActiveRegions;                                                            // 0x0008 (size: 0x10)
    FString BuildId;                                                                  // 0x0018 (size: 0x10)
    FString CommandLineTemplate;                                                      // 0x0028 (size: 0x10)
    FString Comment;                                                                  // 0x0038 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0048 (size: 0x8)
    FString ExecutablePath;                                                           // 0x0050 (size: 0x10)
    int32 MaxGamesPerHost;                                                            // 0x0060 (size: 0x4)
    int32 MinFreeGameSlots;                                                           // 0x0064 (size: 0x4)
    FString Timestamp;                                                                // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FAdminModifyServerBuildResult : public FPlayFabResultCommon
{
    FString ActiveRegions;                                                            // 0x0008 (size: 0x10)
    FString BuildId;                                                                  // 0x0018 (size: 0x10)
    FString CommandLineTemplate;                                                      // 0x0028 (size: 0x10)
    FString Comment;                                                                  // 0x0038 (size: 0x10)
    FString ExecutablePath;                                                           // 0x0048 (size: 0x10)
    int32 MaxGamesPerHost;                                                            // 0x0058 (size: 0x4)
    int32 MinFreeGameSlots;                                                           // 0x005C (size: 0x4)
    EGameBuildStatus Status;                                                          // 0x0060 (size: 0x1)
    FString Timestamp;                                                                // 0x0068 (size: 0x10)
    FString TitleId;                                                                  // 0x0078 (size: 0x10)

}; // Size: 0x88

struct FAdminModifyUserVirtualCurrencyResult : public FPlayFabResultCommon
{
    int32 Balance;                                                                    // 0x0008 (size: 0x4)
    int32 BalanceChange;                                                              // 0x000C (size: 0x4)
    FString PlayFabId;                                                                // 0x0010 (size: 0x10)
    FString VirtualCurrency;                                                          // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FAdminRefundPurchaseRequest : public FPlayFabRequestCommon
{
    FString OrderId;                                                                  // 0x0008 (size: 0x10)
    FString PlayFabId;                                                                // 0x0018 (size: 0x10)
    FString Reason;                                                                   // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FAdminRefundPurchaseResponse : public FPlayFabResultCommon
{
    FString PurchaseStatus;                                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminRemovePlayerTagRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString PlayFabId;                                                                // 0x0010 (size: 0x10)
    FString TagName;                                                                  // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FAdminRemovePlayerTagResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminRemoveServerBuildRequest : public FPlayFabRequestCommon
{
    FString BuildId;                                                                  // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminRemoveServerBuildResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminRemoveVirtualCurrencyTypesRequest : public FPlayFabRequestCommon
{
    TArray<class UPlayFabJsonObject*> VirtualCurrencies;                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminResetCharacterStatisticsRequest : public FPlayFabRequestCommon
{
    FString CharacterId;                                                              // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    FString PlayFabId;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FAdminResetCharacterStatisticsResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminResetPasswordRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString Password;                                                                 // 0x0010 (size: 0x10)
    FString Token;                                                                    // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FAdminResetPasswordResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminResetUserStatisticsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString PlayFabId;                                                                // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAdminResetUserStatisticsResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminResolvePurchaseDisputeRequest : public FPlayFabRequestCommon
{
    FString OrderId;                                                                  // 0x0008 (size: 0x10)
    EResolutionOutcome Outcome;                                                       // 0x0018 (size: 0x1)
    FString PlayFabId;                                                                // 0x0020 (size: 0x10)
    FString Reason;                                                                   // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FAdminResolvePurchaseDisputeResponse : public FPlayFabResultCommon
{
    FString PurchaseStatus;                                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminRevokeAllBansForUserRequest : public FPlayFabRequestCommon
{
    FString PlayFabId;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminRevokeAllBansForUserResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> BanData;                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminRevokeBansRequest : public FPlayFabRequestCommon
{
    FString BanIds;                                                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminRevokeBansResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> BanData;                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminRevokeInventoryItemRequest : public FPlayFabRequestCommon
{
    FString CharacterId;                                                              // 0x0008 (size: 0x10)
    FString ItemInstanceId;                                                           // 0x0018 (size: 0x10)
    FString PlayFabId;                                                                // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FAdminRevokeInventoryItemsRequest : public FPlayFabRequestCommon
{
    TArray<class UPlayFabJsonObject*> Items;                                          // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminRevokeInventoryItemsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Errors;                                         // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminRevokeInventoryResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminRunTaskRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Identifier;                                             // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FAdminRunTaskResult : public FPlayFabResultCommon
{
    FString TaskInstanceId;                                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminSendAccountRecoveryEmailRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString Email;                                                                    // 0x0010 (size: 0x10)
    FString EmailTemplateId;                                                          // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FAdminSendAccountRecoveryEmailResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminSetPlayerSecretRequest : public FPlayFabRequestCommon
{
    FString PlayerSecret;                                                             // 0x0008 (size: 0x10)
    FString PlayFabId;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FAdminSetPlayerSecretResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminSetPublishedRevisionRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    int32 Revision;                                                                   // 0x0010 (size: 0x4)
    int32 Version;                                                                    // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FAdminSetPublishedRevisionResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminSetPublisherDataRequest : public FPlayFabRequestCommon
{
    FString Key;                                                                      // 0x0008 (size: 0x10)
    FString Value;                                                                    // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FAdminSetPublisherDataResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminSetTitleDataAndOverridesRequest : public FPlayFabRequestCommon
{
    TArray<class UPlayFabJsonObject*> KeyValues;                                      // 0x0008 (size: 0x10)
    FString OverrideLabel;                                                            // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FAdminSetTitleDataAndOverridesResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminSetTitleDataRequest : public FPlayFabRequestCommon
{
    FString Key;                                                                      // 0x0008 (size: 0x10)
    FString Value;                                                                    // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FAdminSetTitleDataResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminSetupPushNotificationRequest : public FPlayFabRequestCommon
{
    FString Credential;                                                               // 0x0008 (size: 0x10)
    FString Key;                                                                      // 0x0018 (size: 0x10)
    FString Name;                                                                     // 0x0028 (size: 0x10)
    bool OverwriteOldARN;                                                             // 0x0038 (size: 0x1)
    EPushSetupPlatform Platform;                                                      // 0x0039 (size: 0x1)

}; // Size: 0x40

struct FAdminSetupPushNotificationResult : public FPlayFabResultCommon
{
    FString ARN;                                                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminSubtractUserVirtualCurrencyRequest : public FPlayFabRequestCommon
{
    int32 Amount;                                                                     // 0x0008 (size: 0x4)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    FString PlayFabId;                                                                // 0x0018 (size: 0x10)
    FString VirtualCurrency;                                                          // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FAdminUpdateBansRequest : public FPlayFabRequestCommon
{
    TArray<class UPlayFabJsonObject*> Bans;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminUpdateBansResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> BanData;                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdminUpdateCatalogItemsRequest : public FPlayFabRequestCommon
{
    TArray<class UPlayFabJsonObject*> Catalog;                                        // 0x0008 (size: 0x10)
    FString CatalogVersion;                                                           // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0028 (size: 0x8)
    bool SetAsDefaultCatalog;                                                         // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FAdminUpdateCatalogItemsResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminUpdateCloudScriptRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString DeveloperPlayFabId;                                                       // 0x0010 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Files;                                          // 0x0020 (size: 0x10)
    bool Publish;                                                                     // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FAdminUpdateCloudScriptResult : public FPlayFabResultCommon
{
    int32 Revision;                                                                   // 0x0008 (size: 0x4)
    int32 Version;                                                                    // 0x000C (size: 0x4)

}; // Size: 0x10

struct FAdminUpdateOpenIdConnectionRequest : public FPlayFabRequestCommon
{
    FString ClientId;                                                                 // 0x0008 (size: 0x10)
    FString ClientSecret;                                                             // 0x0018 (size: 0x10)
    FString ConnectionId;                                                             // 0x0028 (size: 0x10)
    FString IssuerDiscoveryUrl;                                                       // 0x0038 (size: 0x10)
    class UPlayFabJsonObject* IssuerInformation;                                      // 0x0048 (size: 0x8)

}; // Size: 0x50

struct FAdminUpdatePlayerSharedSecretRequest : public FPlayFabRequestCommon
{
    bool Disabled;                                                                    // 0x0008 (size: 0x1)
    FString FriendlyName;                                                             // 0x0010 (size: 0x10)
    FString SecretKey;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FAdminUpdatePlayerSharedSecretResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminUpdatePlayerStatisticDefinitionRequest : public FPlayFabRequestCommon
{
    EStatisticAggregationMethod AggregationMethod;                                    // 0x0008 (size: 0x1)
    FString StatisticName;                                                            // 0x0010 (size: 0x10)
    EStatisticResetIntervalOption VersionChangeInterval;                              // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FAdminUpdatePlayerStatisticDefinitionResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Statistic;                                              // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAdminUpdatePolicyRequest : public FPlayFabRequestCommon
{
    bool OverwritePolicy;                                                             // 0x0008 (size: 0x1)
    FString PolicyName;                                                               // 0x0010 (size: 0x10)
    int32 PolicyVersion;                                                              // 0x0020 (size: 0x4)
    TArray<class UPlayFabJsonObject*> Statements;                                     // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FAdminUpdatePolicyResponse : public FPlayFabResultCommon
{
    FString PolicyName;                                                               // 0x0008 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Statements;                                     // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FAdminUpdateRandomResultTablesRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    TArray<class UPlayFabJsonObject*> Tables;                                         // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FAdminUpdateRandomResultTablesResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminUpdateSegmentRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* SegmentModel;                                           // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAdminUpdateSegmentResponse : public FPlayFabResultCommon
{
    FString ErrorMessage;                                                             // 0x0008 (size: 0x10)
    FString SegmentId;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FAdminUpdateStoreItemsRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    class UPlayFabJsonObject* MarketingData;                                          // 0x0020 (size: 0x8)
    TArray<class UPlayFabJsonObject*> Store;                                          // 0x0028 (size: 0x10)
    FString StoreId;                                                                  // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FAdminUpdateStoreItemsResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FAdminUpdateTaskRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString Description;                                                              // 0x0010 (size: 0x10)
    class UPlayFabJsonObject* Identifier;                                             // 0x0020 (size: 0x8)
    bool IsActive;                                                                    // 0x0028 (size: 0x1)
    FString Name;                                                                     // 0x0030 (size: 0x10)
    class UPlayFabJsonObject* Parameter;                                              // 0x0040 (size: 0x8)
    FString Schedule;                                                                 // 0x0048 (size: 0x10)
    EScheduledTaskType Type;                                                          // 0x0058 (size: 0x1)

}; // Size: 0x60

struct FAdminUpdateUserDataRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Data;                                                   // 0x0010 (size: 0x8)
    FString KeysToRemove;                                                             // 0x0018 (size: 0x10)
    EUserDataPermission Permission;                                                   // 0x0028 (size: 0x1)
    FString PlayFabId;                                                                // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FAdminUpdateUserDataResult : public FPlayFabResultCommon
{
    int32 DataVersion;                                                                // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FAdminUpdateUserInternalDataRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Data;                                                   // 0x0010 (size: 0x8)
    FString KeysToRemove;                                                             // 0x0018 (size: 0x10)
    FString PlayFabId;                                                                // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FAdminUpdateUserTitleDisplayNameRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString DisplayName;                                                              // 0x0010 (size: 0x10)
    FString PlayFabId;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FAdminUpdateUserTitleDisplayNameResult : public FPlayFabResultCommon
{
    FString DisplayName;                                                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAuthenticationGetEntityTokenRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FAuthenticationGetEntityTokenResponse : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Entity;                                                 // 0x0008 (size: 0x8)
    FString EntityToken;                                                              // 0x0010 (size: 0x10)
    FString TokenExpiration;                                                          // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FAuthenticationValidateEntityTokenRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString EntityToken;                                                              // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAuthenticationValidateEntityTokenResponse : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Entity;                                                 // 0x0008 (size: 0x8)
    EIdentifiedDeviceType IdentifiedDeviceType;                                       // 0x0010 (size: 0x1)
    ELoginIdentityProvider IdentityProvider;                                          // 0x0011 (size: 0x1)
    class UPlayFabJsonObject* Lineage;                                                // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FClientAcceptTradeRequest : public FPlayFabRequestCommon
{
    FString AcceptedInventoryInstanceIds;                                             // 0x0008 (size: 0x10)
    FString OfferingPlayerId;                                                         // 0x0018 (size: 0x10)
    FString TradeId;                                                                  // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FClientAcceptTradeResponse : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Trade;                                                  // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientAddFriendRequest : public FPlayFabRequestCommon
{
    FString FriendEmail;                                                              // 0x0008 (size: 0x10)
    FString FriendPlayFabId;                                                          // 0x0018 (size: 0x10)
    FString FriendTitleDisplayName;                                                   // 0x0028 (size: 0x10)
    FString FriendUsername;                                                           // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FClientAddFriendResult : public FPlayFabResultCommon
{
    bool Created;                                                                     // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FClientAddGenericIDRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* GenericId;                                              // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientAddGenericIDResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientAddOrUpdateContactEmailRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString EmailAddress;                                                             // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FClientAddOrUpdateContactEmailResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientAddSharedGroupMembersRequest : public FPlayFabRequestCommon
{
    FString PlayFabIds;                                                               // 0x0008 (size: 0x10)
    FString SharedGroupId;                                                            // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientAddSharedGroupMembersResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientAddUserVirtualCurrencyRequest : public FPlayFabRequestCommon
{
    int32 Amount;                                                                     // 0x0008 (size: 0x4)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    FString VirtualCurrency;                                                          // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientAddUsernamePasswordRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString Email;                                                                    // 0x0010 (size: 0x10)
    FString Password;                                                                 // 0x0020 (size: 0x10)
    FString Username;                                                                 // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FClientAddUsernamePasswordResult : public FPlayFabResultCommon
{
    FString Username;                                                                 // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientAndroidDevicePushNotificationRegistrationRequest : public FPlayFabRequestCommon
{
    FString ConfirmationMessage;                                                      // 0x0008 (size: 0x10)
    FString DeviceToken;                                                              // 0x0018 (size: 0x10)
    bool SendPushNotificationConfirmation;                                            // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FClientAndroidDevicePushNotificationRegistrationResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientAttributeInstallRequest : public FPlayFabRequestCommon
{
    FString Adid;                                                                     // 0x0008 (size: 0x10)
    FString Idfa;                                                                     // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientAttributeInstallResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientCancelTradeRequest : public FPlayFabRequestCommon
{
    FString TradeId;                                                                  // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientCancelTradeResponse : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Trade;                                                  // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientConfirmPurchaseRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString OrderId;                                                                  // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FClientConfirmPurchaseResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Items;                                          // 0x0008 (size: 0x10)
    FString OrderId;                                                                  // 0x0018 (size: 0x10)
    FString PurchaseDate;                                                             // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FClientConsumeItemRequest : public FPlayFabRequestCommon
{
    FString CharacterId;                                                              // 0x0008 (size: 0x10)
    int32 ConsumeCount;                                                               // 0x0018 (size: 0x4)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0020 (size: 0x8)
    FString ItemInstanceId;                                                           // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FClientConsumeItemResult : public FPlayFabResultCommon
{
    FString ItemInstanceId;                                                           // 0x0008 (size: 0x10)
    int32 RemainingUses;                                                              // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FClientConsumeMicrosoftStoreEntitlementsRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    class UPlayFabJsonObject* MarketplaceSpecificData;                                // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FClientConsumeMicrosoftStoreEntitlementsResponse : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Items;                                          // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientConsumePS5EntitlementsRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    class UPlayFabJsonObject* MarketplaceSpecificData;                                // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FClientConsumePS5EntitlementsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Items;                                          // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientConsumePSNEntitlementsRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    int32 ServiceLabel;                                                               // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FClientConsumePSNEntitlementsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> ItemsGranted;                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientConsumeXboxEntitlementsRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    FString XboxToken;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FClientConsumeXboxEntitlementsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Items;                                          // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientCreateSharedGroupRequest : public FPlayFabRequestCommon
{
    FString SharedGroupId;                                                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientCreateSharedGroupResult : public FPlayFabResultCommon
{
    FString SharedGroupId;                                                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientCurrentGamesRequest : public FPlayFabRequestCommon
{
    FString BuildVersion;                                                             // 0x0008 (size: 0x10)
    FString GameMode;                                                                 // 0x0018 (size: 0x10)
    ERegion Region;                                                                   // 0x0028 (size: 0x1)
    FString StatisticName;                                                            // 0x0030 (size: 0x10)
    class UPlayFabJsonObject* TagFilter;                                              // 0x0040 (size: 0x8)

}; // Size: 0x48

struct FClientCurrentGamesResult : public FPlayFabResultCommon
{
    int32 GameCount;                                                                  // 0x0008 (size: 0x4)
    TArray<class UPlayFabJsonObject*> Games;                                          // 0x0010 (size: 0x10)
    int32 PlayerCount;                                                                // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FClientDeviceInfoRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* Info;                                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientEmptyResponse : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientEmptyResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientExecuteCloudScriptRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString FunctionName;                                                             // 0x0010 (size: 0x10)
    class UPlayFabJsonObject* FunctionParameter;                                      // 0x0020 (size: 0x8)
    bool GeneratePlayStreamEvent;                                                     // 0x0028 (size: 0x1)
    ECloudScriptRevisionOption RevisionSelection;                                     // 0x0029 (size: 0x1)
    int32 SpecificRevision;                                                           // 0x002C (size: 0x4)

}; // Size: 0x30

struct FClientExecuteCloudScriptResult : public FPlayFabResultCommon
{
    int32 APIRequestsIssued;                                                          // 0x0008 (size: 0x4)
    class UPlayFabJsonObject* Error;                                                  // 0x0010 (size: 0x8)
    int32 ExecutionTimeSeconds;                                                       // 0x0018 (size: 0x4)
    FString FunctionName;                                                             // 0x0020 (size: 0x10)
    class UPlayFabJsonObject* FunctionResult;                                         // 0x0030 (size: 0x8)
    bool FunctionResultTooLarge;                                                      // 0x0038 (size: 0x1)
    int32 HttpRequestsIssued;                                                         // 0x003C (size: 0x4)
    TArray<class UPlayFabJsonObject*> Logs;                                           // 0x0040 (size: 0x10)
    bool LogsTooLarge;                                                                // 0x0050 (size: 0x1)
    int32 MemoryConsumedBytes;                                                        // 0x0054 (size: 0x4)
    int32 ProcessorTimeSeconds;                                                       // 0x0058 (size: 0x4)
    int32 Revision;                                                                   // 0x005C (size: 0x4)

}; // Size: 0x60

struct FClientGameServerRegionsRequest : public FPlayFabRequestCommon
{
    FString BuildVersion;                                                             // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGameServerRegionsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Regions;                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetAccountInfoRequest : public FPlayFabRequestCommon
{
    FString Email;                                                                    // 0x0008 (size: 0x10)
    FString PlayFabId;                                                                // 0x0018 (size: 0x10)
    FString TitleDisplayName;                                                         // 0x0028 (size: 0x10)
    FString Username;                                                                 // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FClientGetAccountInfoResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* AccountInfo;                                            // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientGetAdPlacementsRequest : public FPlayFabRequestCommon
{
    FString AppId;                                                                    // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* Identifier;                                             // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FClientGetAdPlacementsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> AdPlacements;                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetCatalogItemsRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetCatalogItemsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Catalog;                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetCharacterDataRequest : public FPlayFabRequestCommon
{
    FString CharacterId;                                                              // 0x0008 (size: 0x10)
    int32 IfChangedFromDataVersion;                                                   // 0x0018 (size: 0x4)
    FString Keys;                                                                     // 0x0020 (size: 0x10)
    FString PlayFabId;                                                                // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FClientGetCharacterDataResult : public FPlayFabResultCommon
{
    FString CharacterId;                                                              // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* Data;                                                   // 0x0018 (size: 0x8)
    int32 DataVersion;                                                                // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FClientGetCharacterInventoryRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    FString CharacterId;                                                              // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FClientGetCharacterInventoryResult : public FPlayFabResultCommon
{
    FString CharacterId;                                                              // 0x0008 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Inventory;                                      // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* VirtualCurrency;                                        // 0x0028 (size: 0x8)
    class UPlayFabJsonObject* VirtualCurrencyRechargeTimes;                           // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FClientGetCharacterLeaderboardRequest : public FPlayFabRequestCommon
{
    FString CharacterType;                                                            // 0x0008 (size: 0x10)
    int32 MaxResultsCount;                                                            // 0x0018 (size: 0x4)
    int32 StartPosition;                                                              // 0x001C (size: 0x4)
    FString StatisticName;                                                            // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FClientGetCharacterLeaderboardResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Leaderboard;                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetCharacterStatisticsRequest : public FPlayFabRequestCommon
{
    FString CharacterId;                                                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetCharacterStatisticsResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* CharacterStatistics;                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientGetContentDownloadUrlRequest : public FPlayFabRequestCommon
{
    FString HttpMethod;                                                               // 0x0008 (size: 0x10)
    FString Key;                                                                      // 0x0018 (size: 0x10)
    bool ThruCDN;                                                                     // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FClientGetContentDownloadUrlResult : public FPlayFabResultCommon
{
    FString URL;                                                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetFriendLeaderboardAroundPlayerRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    bool IncludeFacebookFriends;                                                      // 0x0010 (size: 0x1)
    bool IncludeSteamFriends;                                                         // 0x0011 (size: 0x1)
    int32 MaxResultsCount;                                                            // 0x0014 (size: 0x4)
    FString PlayFabId;                                                                // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* ProfileConstraints;                                     // 0x0028 (size: 0x8)
    FString StatisticName;                                                            // 0x0030 (size: 0x10)
    bool UseSpecificVersion;                                                          // 0x0040 (size: 0x1)
    int32 Version;                                                                    // 0x0044 (size: 0x4)
    FString XboxToken;                                                                // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FClientGetFriendLeaderboardAroundPlayerResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Leaderboard;                                    // 0x0008 (size: 0x10)
    FString NextReset;                                                                // 0x0018 (size: 0x10)
    int32 Version;                                                                    // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FClientGetFriendLeaderboardRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    bool IncludeFacebookFriends;                                                      // 0x0010 (size: 0x1)
    bool IncludeSteamFriends;                                                         // 0x0011 (size: 0x1)
    int32 MaxResultsCount;                                                            // 0x0014 (size: 0x4)
    class UPlayFabJsonObject* ProfileConstraints;                                     // 0x0018 (size: 0x8)
    int32 StartPosition;                                                              // 0x0020 (size: 0x4)
    FString StatisticName;                                                            // 0x0028 (size: 0x10)
    bool UseSpecificVersion;                                                          // 0x0038 (size: 0x1)
    int32 Version;                                                                    // 0x003C (size: 0x4)
    FString XboxToken;                                                                // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FClientGetFriendsListRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    bool IncludeFacebookFriends;                                                      // 0x0010 (size: 0x1)
    bool IncludeSteamFriends;                                                         // 0x0011 (size: 0x1)
    class UPlayFabJsonObject* ProfileConstraints;                                     // 0x0018 (size: 0x8)
    FString XboxToken;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FClientGetFriendsListResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Friends;                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetLeaderboardAroundCharacterRequest : public FPlayFabRequestCommon
{
    FString CharacterId;                                                              // 0x0008 (size: 0x10)
    FString CharacterType;                                                            // 0x0018 (size: 0x10)
    int32 MaxResultsCount;                                                            // 0x0028 (size: 0x4)
    FString StatisticName;                                                            // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FClientGetLeaderboardAroundCharacterResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Leaderboard;                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetLeaderboardAroundPlayerRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    int32 MaxResultsCount;                                                            // 0x0010 (size: 0x4)
    FString PlayFabId;                                                                // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* ProfileConstraints;                                     // 0x0028 (size: 0x8)
    FString StatisticName;                                                            // 0x0030 (size: 0x10)
    bool UseSpecificVersion;                                                          // 0x0040 (size: 0x1)
    int32 Version;                                                                    // 0x0044 (size: 0x4)

}; // Size: 0x48

struct FClientGetLeaderboardAroundPlayerResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Leaderboard;                                    // 0x0008 (size: 0x10)
    FString NextReset;                                                                // 0x0018 (size: 0x10)
    int32 Version;                                                                    // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FClientGetLeaderboardForUsersCharactersRequest : public FPlayFabRequestCommon
{
    int32 MaxResultsCount;                                                            // 0x0008 (size: 0x4)
    FString StatisticName;                                                            // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FClientGetLeaderboardForUsersCharactersResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Leaderboard;                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetLeaderboardRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    int32 MaxResultsCount;                                                            // 0x0010 (size: 0x4)
    class UPlayFabJsonObject* ProfileConstraints;                                     // 0x0018 (size: 0x8)
    int32 StartPosition;                                                              // 0x0020 (size: 0x4)
    FString StatisticName;                                                            // 0x0028 (size: 0x10)
    bool UseSpecificVersion;                                                          // 0x0038 (size: 0x1)
    int32 Version;                                                                    // 0x003C (size: 0x4)

}; // Size: 0x40

struct FClientGetLeaderboardResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Leaderboard;                                    // 0x0008 (size: 0x10)
    FString NextReset;                                                                // 0x0018 (size: 0x10)
    int32 Version;                                                                    // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FClientGetPaymentTokenRequest : public FPlayFabRequestCommon
{
    FString TokenProvider;                                                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPaymentTokenResult : public FPlayFabResultCommon
{
    FString OrderId;                                                                  // 0x0008 (size: 0x10)
    FString ProviderToken;                                                            // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientGetPhotonAuthenticationTokenRequest : public FPlayFabRequestCommon
{
    FString PhotonApplicationId;                                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPhotonAuthenticationTokenResult : public FPlayFabResultCommon
{
    FString PhotonCustomAuthenticationToken;                                          // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayFabIDsFromFacebookIDsRequest : public FPlayFabRequestCommon
{
    FString FacebookIDs;                                                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayFabIDsFromFacebookIDsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Data;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayFabIDsFromFacebookInstantGamesIdsRequest : public FPlayFabRequestCommon
{
    FString FacebookInstantGamesIds;                                                  // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayFabIDsFromFacebookInstantGamesIdsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Data;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayFabIDsFromGameCenterIDsRequest : public FPlayFabRequestCommon
{
    FString GameCenterIDs;                                                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayFabIDsFromGameCenterIDsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Data;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayFabIDsFromGenericIDsRequest : public FPlayFabRequestCommon
{
    TArray<class UPlayFabJsonObject*> GenericIDs;                                     // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayFabIDsFromGenericIDsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Data;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayFabIDsFromGoogleIDsRequest : public FPlayFabRequestCommon
{
    FString GoogleIDs;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayFabIDsFromGoogleIDsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Data;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayFabIDsFromKongregateIDsRequest : public FPlayFabRequestCommon
{
    FString KongregateIDs;                                                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayFabIDsFromKongregateIDsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Data;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayFabIDsFromNintendoSwitchDeviceIdsRequest : public FPlayFabRequestCommon
{
    FString NintendoSwitchDeviceIds;                                                  // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayFabIDsFromNintendoSwitchDeviceIdsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Data;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayFabIDsFromPSNAccountIDsRequest : public FPlayFabRequestCommon
{
    int32 IssuerId;                                                                   // 0x0008 (size: 0x4)
    FString PSNAccountIDs;                                                            // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FClientGetPlayFabIDsFromPSNAccountIDsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Data;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayFabIDsFromSteamIDsRequest : public FPlayFabRequestCommon
{
    FString SteamStringIDs;                                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayFabIDsFromSteamIDsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Data;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayFabIDsFromTwitchIDsRequest : public FPlayFabRequestCommon
{
    FString TwitchIds;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayFabIDsFromTwitchIDsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Data;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayFabIDsFromXboxLiveIDsRequest : public FPlayFabRequestCommon
{
    FString Sandbox;                                                                  // 0x0008 (size: 0x10)
    FString XboxLiveAccountIDs;                                                       // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientGetPlayFabIDsFromXboxLiveIDsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Data;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayerCombinedInfoRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0010 (size: 0x8)
    FString PlayFabId;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientGetPlayerCombinedInfoResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* InfoResultPayload;                                      // 0x0008 (size: 0x8)
    FString PlayFabId;                                                                // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FClientGetPlayerProfileRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString PlayFabId;                                                                // 0x0010 (size: 0x10)
    class UPlayFabJsonObject* ProfileConstraints;                                     // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FClientGetPlayerProfileResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* PlayerProfile;                                          // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientGetPlayerSegmentsRequest : public FPlayFabRequestCommon
{
}; // Size: 0x8

struct FClientGetPlayerSegmentsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Segments;                                       // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayerStatisticVersionsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString StatisticName;                                                            // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FClientGetPlayerStatisticVersionsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> StatisticVersions;                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayerStatisticsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString StatisticNames;                                                           // 0x0010 (size: 0x10)
    TArray<class UPlayFabJsonObject*> StatisticNameVersions;                          // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FClientGetPlayerStatisticsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Statistics;                                     // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPlayerTagsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString Namespace;                                                                // 0x0010 (size: 0x10)
    FString PlayFabId;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FClientGetPlayerTagsResult : public FPlayFabResultCommon
{
    FString PlayFabId;                                                                // 0x0008 (size: 0x10)
    FString Tags;                                                                     // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientGetPlayerTradesRequest : public FPlayFabRequestCommon
{
    ETradeStatus StatusFilter;                                                        // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FClientGetPlayerTradesResponse : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> AcceptedTrades;                                 // 0x0008 (size: 0x10)
    TArray<class UPlayFabJsonObject*> OpenedTrades;                                   // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientGetPublisherDataRequest : public FPlayFabRequestCommon
{
    FString Keys;                                                                     // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPublisherDataResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Data;                                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientGetPurchaseRequest : public FPlayFabRequestCommon
{
    FString OrderId;                                                                  // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetPurchaseResult : public FPlayFabResultCommon
{
    FString OrderId;                                                                  // 0x0008 (size: 0x10)
    FString PaymentProvider;                                                          // 0x0018 (size: 0x10)
    FString PurchaseDate;                                                             // 0x0028 (size: 0x10)
    FString TransactionId;                                                            // 0x0038 (size: 0x10)
    FString TransactionStatus;                                                        // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FClientGetSharedGroupDataRequest : public FPlayFabRequestCommon
{
    bool GetMembers;                                                                  // 0x0008 (size: 0x1)
    FString Keys;                                                                     // 0x0010 (size: 0x10)
    FString SharedGroupId;                                                            // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FClientGetSharedGroupDataResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Data;                                                   // 0x0008 (size: 0x8)
    FString Members;                                                                  // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FClientGetStoreItemsRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    FString StoreId;                                                                  // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientGetStoreItemsResult : public FPlayFabResultCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* MarketingData;                                          // 0x0018 (size: 0x8)
    EPfSourceType Source;                                                             // 0x0020 (size: 0x1)
    TArray<class UPlayFabJsonObject*> Store;                                          // 0x0028 (size: 0x10)
    FString StoreId;                                                                  // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FClientGetTimeRequest : public FPlayFabRequestCommon
{
}; // Size: 0x8

struct FClientGetTimeResult : public FPlayFabResultCommon
{
    FString Time;                                                                     // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetTitleDataRequest : public FPlayFabRequestCommon
{
    FString Keys;                                                                     // 0x0008 (size: 0x10)
    FString OverrideLabel;                                                            // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientGetTitleDataResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Data;                                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientGetTitleNewsRequest : public FPlayFabRequestCommon
{
    int32 Count;                                                                      // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FClientGetTitleNewsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> News;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetTitlePublicKeyRequest : public FPlayFabRequestCommon
{
    FString TitleSharedSecret;                                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetTitlePublicKeyResult : public FPlayFabResultCommon
{
    FString RSAPublicKey;                                                             // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientGetTradeStatusRequest : public FPlayFabRequestCommon
{
    FString OfferingPlayerId;                                                         // 0x0008 (size: 0x10)
    FString TradeId;                                                                  // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientGetTradeStatusResponse : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Trade;                                                  // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientGetUserDataRequest : public FPlayFabRequestCommon
{
    int32 IfChangedFromDataVersion;                                                   // 0x0008 (size: 0x4)
    FString Keys;                                                                     // 0x0010 (size: 0x10)
    FString PlayFabId;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FClientGetUserDataResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Data;                                                   // 0x0008 (size: 0x8)
    int32 DataVersion;                                                                // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FClientGetUserInventoryRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientGetUserInventoryResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Inventory;                                      // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* VirtualCurrency;                                        // 0x0018 (size: 0x8)
    class UPlayFabJsonObject* VirtualCurrencyRechargeTimes;                           // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FClientGrantCharacterToUserRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    FString CharacterName;                                                            // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0028 (size: 0x8)
    FString ItemId;                                                                   // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FClientGrantCharacterToUserResult : public FPlayFabResultCommon
{
    FString CharacterId;                                                              // 0x0008 (size: 0x10)
    FString CharacterType;                                                            // 0x0018 (size: 0x10)
    bool Result;                                                                      // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FClientLinkAndroidDeviceIDRequest : public FPlayFabRequestCommon
{
    FString AndroidDevice;                                                            // 0x0008 (size: 0x10)
    FString AndroidDeviceId;                                                          // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0028 (size: 0x8)
    bool ForceLink;                                                                   // 0x0030 (size: 0x1)
    FString OS;                                                                       // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FClientLinkAndroidDeviceIDResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientLinkAppleRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    bool ForceLink;                                                                   // 0x0010 (size: 0x1)
    FString IdentityToken;                                                            // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientLinkCustomIDRequest : public FPlayFabRequestCommon
{
    FString CustomId;                                                                 // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    bool ForceLink;                                                                   // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FClientLinkCustomIDResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientLinkFacebookAccountRequest : public FPlayFabRequestCommon
{
    FString AccessToken;                                                              // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    bool ForceLink;                                                                   // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FClientLinkFacebookAccountResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientLinkFacebookInstantGamesIdRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString FacebookInstantGamesSignature;                                            // 0x0010 (size: 0x10)
    bool ForceLink;                                                                   // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FClientLinkFacebookInstantGamesIdResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientLinkGameCenterAccountRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    bool ForceLink;                                                                   // 0x0010 (size: 0x1)
    FString GameCenterId;                                                             // 0x0018 (size: 0x10)
    FString PublicKeyUrl;                                                             // 0x0028 (size: 0x10)
    FString Salt;                                                                     // 0x0038 (size: 0x10)
    FString Signature;                                                                // 0x0048 (size: 0x10)
    FString Timestamp;                                                                // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FClientLinkGameCenterAccountResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientLinkGoogleAccountRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    bool ForceLink;                                                                   // 0x0010 (size: 0x1)
    FString ServerAuthCode;                                                           // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientLinkGoogleAccountResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientLinkIOSDeviceIDRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString DeviceID;                                                                 // 0x0010 (size: 0x10)
    FString DeviceModel;                                                              // 0x0020 (size: 0x10)
    bool ForceLink;                                                                   // 0x0030 (size: 0x1)
    FString OS;                                                                       // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FClientLinkIOSDeviceIDResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientLinkKongregateAccountRequest : public FPlayFabRequestCommon
{
    FString AuthTicket;                                                               // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    bool ForceLink;                                                                   // 0x0020 (size: 0x1)
    FString KongregateId;                                                             // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FClientLinkKongregateAccountResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientLinkNintendoServiceAccountRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    bool ForceLink;                                                                   // 0x0010 (size: 0x1)
    FString IdentityToken;                                                            // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientLinkNintendoSwitchDeviceIdRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    bool ForceLink;                                                                   // 0x0010 (size: 0x1)
    FString NintendoSwitchDeviceId;                                                   // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientLinkNintendoSwitchDeviceIdResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientLinkOpenIdConnectRequest : public FPlayFabRequestCommon
{
    FString ConnectionId;                                                             // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    bool ForceLink;                                                                   // 0x0020 (size: 0x1)
    FString IdToken;                                                                  // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FClientLinkPSNAccountRequest : public FPlayFabRequestCommon
{
    FString AuthCode;                                                                 // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    bool ForceLink;                                                                   // 0x0020 (size: 0x1)
    int32 IssuerId;                                                                   // 0x0024 (size: 0x4)
    FString RedirectUri;                                                              // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FClientLinkPSNAccountResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientLinkSteamAccountRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    bool ForceLink;                                                                   // 0x0010 (size: 0x1)
    FString SteamTicket;                                                              // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientLinkSteamAccountResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientLinkTwitchAccountRequest : public FPlayFabRequestCommon
{
    FString AccessToken;                                                              // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    bool ForceLink;                                                                   // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FClientLinkTwitchAccountResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientLinkXboxAccountRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    bool ForceLink;                                                                   // 0x0010 (size: 0x1)
    FString XboxToken;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientLinkXboxAccountResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientListUsersCharactersRequest : public FPlayFabRequestCommon
{
    FString PlayFabId;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientListUsersCharactersResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Characters;                                     // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientLoginResult : public FPlayFabLoginResultCommon
{
    class UPlayFabJsonObject* EntityToken;                                            // 0x0010 (size: 0x8)
    class UPlayFabJsonObject* InfoResultPayload;                                      // 0x0018 (size: 0x8)
    FString LastLoginTime;                                                            // 0x0020 (size: 0x10)
    bool NewlyCreated;                                                                // 0x0030 (size: 0x1)
    FString PlayFabId;                                                                // 0x0038 (size: 0x10)
    FString SessionTicket;                                                            // 0x0048 (size: 0x10)
    class UPlayFabJsonObject* SettingsForUser;                                        // 0x0058 (size: 0x8)
    class UPlayFabJsonObject* TreatmentAssignment;                                    // 0x0060 (size: 0x8)

}; // Size: 0x68

struct FClientLoginWithAndroidDeviceIDRequest : public FPlayFabRequestCommon
{
    FString AndroidDevice;                                                            // 0x0008 (size: 0x10)
    FString AndroidDeviceId;                                                          // 0x0018 (size: 0x10)
    bool CreateAccount;                                                               // 0x0028 (size: 0x1)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0030 (size: 0x8)
    FString EncryptedRequest;                                                         // 0x0038 (size: 0x10)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0048 (size: 0x8)
    FString OS;                                                                       // 0x0050 (size: 0x10)
    FString PlayerSecret;                                                             // 0x0060 (size: 0x10)

}; // Size: 0x70

struct FClientLoginWithAppleRequest : public FPlayFabRequestCommon
{
    bool CreateAccount;                                                               // 0x0008 (size: 0x1)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    FString EncryptedRequest;                                                         // 0x0018 (size: 0x10)
    FString IdentityToken;                                                            // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0038 (size: 0x8)
    FString PlayerSecret;                                                             // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FClientLoginWithCustomIDRequest : public FPlayFabRequestCommon
{
    bool CreateAccount;                                                               // 0x0008 (size: 0x1)
    FString CustomId;                                                                 // 0x0010 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0020 (size: 0x8)
    FString EncryptedRequest;                                                         // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0038 (size: 0x8)
    FString PlayerSecret;                                                             // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FClientLoginWithEmailAddressRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString Email;                                                                    // 0x0010 (size: 0x10)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0020 (size: 0x8)
    FString Password;                                                                 // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FClientLoginWithFacebookInstantGamesIdRequest : public FPlayFabRequestCommon
{
    bool CreateAccount;                                                               // 0x0008 (size: 0x1)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    FString EncryptedRequest;                                                         // 0x0018 (size: 0x10)
    FString FacebookInstantGamesSignature;                                            // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0038 (size: 0x8)
    FString PlayerSecret;                                                             // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FClientLoginWithFacebookRequest : public FPlayFabRequestCommon
{
    FString AccessToken;                                                              // 0x0008 (size: 0x10)
    bool CreateAccount;                                                               // 0x0018 (size: 0x1)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0020 (size: 0x8)
    FString EncryptedRequest;                                                         // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0038 (size: 0x8)
    FString PlayerSecret;                                                             // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FClientLoginWithGameCenterRequest : public FPlayFabRequestCommon
{
    bool CreateAccount;                                                               // 0x0008 (size: 0x1)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    FString EncryptedRequest;                                                         // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0028 (size: 0x8)
    FString PlayerId;                                                                 // 0x0030 (size: 0x10)
    FString PlayerSecret;                                                             // 0x0040 (size: 0x10)
    FString PublicKeyUrl;                                                             // 0x0050 (size: 0x10)
    FString Salt;                                                                     // 0x0060 (size: 0x10)
    FString Signature;                                                                // 0x0070 (size: 0x10)
    FString Timestamp;                                                                // 0x0080 (size: 0x10)

}; // Size: 0x90

struct FClientLoginWithGoogleAccountRequest : public FPlayFabRequestCommon
{
    bool CreateAccount;                                                               // 0x0008 (size: 0x1)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    FString EncryptedRequest;                                                         // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0028 (size: 0x8)
    FString PlayerSecret;                                                             // 0x0030 (size: 0x10)
    FString ServerAuthCode;                                                           // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FClientLoginWithIOSDeviceIDRequest : public FPlayFabRequestCommon
{
    bool CreateAccount;                                                               // 0x0008 (size: 0x1)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    FString DeviceID;                                                                 // 0x0018 (size: 0x10)
    FString DeviceModel;                                                              // 0x0028 (size: 0x10)
    FString EncryptedRequest;                                                         // 0x0038 (size: 0x10)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0048 (size: 0x8)
    FString OS;                                                                       // 0x0050 (size: 0x10)
    FString PlayerSecret;                                                             // 0x0060 (size: 0x10)

}; // Size: 0x70

struct FClientLoginWithKongregateRequest : public FPlayFabRequestCommon
{
    FString AuthTicket;                                                               // 0x0008 (size: 0x10)
    bool CreateAccount;                                                               // 0x0018 (size: 0x1)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0020 (size: 0x8)
    FString EncryptedRequest;                                                         // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0038 (size: 0x8)
    FString KongregateId;                                                             // 0x0040 (size: 0x10)
    FString PlayerSecret;                                                             // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FClientLoginWithNintendoServiceAccountRequest : public FPlayFabRequestCommon
{
    bool CreateAccount;                                                               // 0x0008 (size: 0x1)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    FString EncryptedRequest;                                                         // 0x0018 (size: 0x10)
    FString IdentityToken;                                                            // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0038 (size: 0x8)
    FString PlayerSecret;                                                             // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FClientLoginWithNintendoSwitchDeviceIdRequest : public FPlayFabRequestCommon
{
    bool CreateAccount;                                                               // 0x0008 (size: 0x1)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    FString EncryptedRequest;                                                         // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0028 (size: 0x8)
    FString NintendoSwitchDeviceId;                                                   // 0x0030 (size: 0x10)
    FString PlayerSecret;                                                             // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FClientLoginWithOpenIdConnectRequest : public FPlayFabRequestCommon
{
    FString ConnectionId;                                                             // 0x0008 (size: 0x10)
    bool CreateAccount;                                                               // 0x0018 (size: 0x1)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0020 (size: 0x8)
    FString EncryptedRequest;                                                         // 0x0028 (size: 0x10)
    FString IdToken;                                                                  // 0x0038 (size: 0x10)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0048 (size: 0x8)
    FString PlayerSecret;                                                             // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FClientLoginWithPSNRequest : public FPlayFabRequestCommon
{
    FString AuthCode;                                                                 // 0x0008 (size: 0x10)
    bool CreateAccount;                                                               // 0x0018 (size: 0x1)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0020 (size: 0x8)
    FString EncryptedRequest;                                                         // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0038 (size: 0x8)
    int32 IssuerId;                                                                   // 0x0040 (size: 0x4)
    FString PlayerSecret;                                                             // 0x0048 (size: 0x10)
    FString RedirectUri;                                                              // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FClientLoginWithPlayFabRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0010 (size: 0x8)
    FString Password;                                                                 // 0x0018 (size: 0x10)
    FString Username;                                                                 // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FClientLoginWithSteamRequest : public FPlayFabRequestCommon
{
    bool CreateAccount;                                                               // 0x0008 (size: 0x1)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    FString EncryptedRequest;                                                         // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0028 (size: 0x8)
    FString PlayerSecret;                                                             // 0x0030 (size: 0x10)
    FString SteamTicket;                                                              // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FClientLoginWithTwitchRequest : public FPlayFabRequestCommon
{
    FString AccessToken;                                                              // 0x0008 (size: 0x10)
    bool CreateAccount;                                                               // 0x0018 (size: 0x1)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0020 (size: 0x8)
    FString EncryptedRequest;                                                         // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0038 (size: 0x8)
    FString PlayerSecret;                                                             // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FClientLoginWithXboxRequest : public FPlayFabRequestCommon
{
    bool CreateAccount;                                                               // 0x0008 (size: 0x1)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    FString EncryptedRequest;                                                         // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0028 (size: 0x8)
    FString PlayerSecret;                                                             // 0x0030 (size: 0x10)
    FString XboxToken;                                                                // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FClientMatchmakeRequest : public FPlayFabRequestCommon
{
    FString BuildVersion;                                                             // 0x0008 (size: 0x10)
    FString CharacterId;                                                              // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0028 (size: 0x8)
    FString GameMode;                                                                 // 0x0030 (size: 0x10)
    FString LobbyId;                                                                  // 0x0040 (size: 0x10)
    ERegion Region;                                                                   // 0x0050 (size: 0x1)
    bool StartNewIfNoneFound;                                                         // 0x0051 (size: 0x1)
    FString StatisticName;                                                            // 0x0058 (size: 0x10)
    class UPlayFabJsonObject* TagFilter;                                              // 0x0068 (size: 0x8)

}; // Size: 0x70

struct FClientMatchmakeResult : public FPlayFabResultCommon
{
    FString Expires;                                                                  // 0x0008 (size: 0x10)
    FString LobbyId;                                                                  // 0x0018 (size: 0x10)
    int32 PollWaitTimeMS;                                                             // 0x0028 (size: 0x4)
    FString ServerIPV4Address;                                                        // 0x0030 (size: 0x10)
    FString ServerIPV6Address;                                                        // 0x0040 (size: 0x10)
    int32 ServerPort;                                                                 // 0x0050 (size: 0x4)
    FString ServerPublicDNSName;                                                      // 0x0058 (size: 0x10)
    EMatchmakeStatus Status;                                                          // 0x0068 (size: 0x1)
    FString Ticket;                                                                   // 0x0070 (size: 0x10)

}; // Size: 0x80

struct FClientModifyUserVirtualCurrencyResult : public FPlayFabResultCommon
{
    int32 Balance;                                                                    // 0x0008 (size: 0x4)
    int32 BalanceChange;                                                              // 0x000C (size: 0x4)
    FString PlayFabId;                                                                // 0x0010 (size: 0x10)
    FString VirtualCurrency;                                                          // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FClientOpenTradeRequest : public FPlayFabRequestCommon
{
    FString AllowedPlayerIds;                                                         // 0x0008 (size: 0x10)
    FString OfferedInventoryInstanceIds;                                              // 0x0018 (size: 0x10)
    FString RequestedCatalogItemIds;                                                  // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FClientOpenTradeResponse : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Trade;                                                  // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientPayForPurchaseRequest : public FPlayFabRequestCommon
{
    FString Currency;                                                                 // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    FString OrderId;                                                                  // 0x0020 (size: 0x10)
    FString ProviderName;                                                             // 0x0030 (size: 0x10)
    FString ProviderTransactionId;                                                    // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FClientPayForPurchaseResult : public FPlayFabResultCommon
{
    int32 CreditApplied;                                                              // 0x0008 (size: 0x4)
    FString OrderId;                                                                  // 0x0010 (size: 0x10)
    FString ProviderData;                                                             // 0x0020 (size: 0x10)
    FString ProviderToken;                                                            // 0x0030 (size: 0x10)
    FString PurchaseConfirmationPageURL;                                              // 0x0040 (size: 0x10)
    FString PurchaseCurrency;                                                         // 0x0050 (size: 0x10)
    int32 PurchasePrice;                                                              // 0x0060 (size: 0x4)
    ETransactionStatus Status;                                                        // 0x0064 (size: 0x1)
    class UPlayFabJsonObject* VCAmount;                                               // 0x0068 (size: 0x8)
    class UPlayFabJsonObject* VirtualCurrency;                                        // 0x0070 (size: 0x8)

}; // Size: 0x78

struct FClientPurchaseItemRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    FString CharacterId;                                                              // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0028 (size: 0x8)
    FString ItemId;                                                                   // 0x0030 (size: 0x10)
    int32 Price;                                                                      // 0x0040 (size: 0x4)
    FString StoreId;                                                                  // 0x0048 (size: 0x10)
    FString VirtualCurrency;                                                          // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FClientPurchaseItemResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Items;                                          // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientRedeemCouponRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    FString CharacterId;                                                              // 0x0018 (size: 0x10)
    FString CouponCode;                                                               // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FClientRedeemCouponResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> GrantedItems;                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientRefreshPSNAuthTokenRequest : public FPlayFabRequestCommon
{
    FString AuthCode;                                                                 // 0x0008 (size: 0x10)
    int32 IssuerId;                                                                   // 0x0018 (size: 0x4)
    FString RedirectUri;                                                              // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FClientRegisterForIOSPushNotificationRequest : public FPlayFabRequestCommon
{
    FString ConfirmationMessage;                                                      // 0x0008 (size: 0x10)
    FString DeviceToken;                                                              // 0x0018 (size: 0x10)
    bool SendPushNotificationConfirmation;                                            // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FClientRegisterForIOSPushNotificationResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientRegisterPlayFabUserRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString DisplayName;                                                              // 0x0010 (size: 0x10)
    FString Email;                                                                    // 0x0020 (size: 0x10)
    FString EncryptedRequest;                                                         // 0x0030 (size: 0x10)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0040 (size: 0x8)
    FString Password;                                                                 // 0x0048 (size: 0x10)
    FString PlayerSecret;                                                             // 0x0058 (size: 0x10)
    bool RequireBothUsernameAndEmail;                                                 // 0x0068 (size: 0x1)
    FString Username;                                                                 // 0x0070 (size: 0x10)

}; // Size: 0x80

struct FClientRegisterPlayFabUserResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* EntityToken;                                            // 0x0008 (size: 0x8)
    FString PlayFabId;                                                                // 0x0010 (size: 0x10)
    FString SessionTicket;                                                            // 0x0020 (size: 0x10)
    class UPlayFabJsonObject* SettingsForUser;                                        // 0x0030 (size: 0x8)
    FString Username;                                                                 // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FClientRemoveContactEmailRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientRemoveContactEmailResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientRemoveFriendRequest : public FPlayFabRequestCommon
{
    FString FriendPlayFabId;                                                          // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientRemoveFriendResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientRemoveGenericIDRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* GenericId;                                              // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientRemoveGenericIDResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientRemoveSharedGroupMembersRequest : public FPlayFabRequestCommon
{
    FString PlayFabIds;                                                               // 0x0008 (size: 0x10)
    FString SharedGroupId;                                                            // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientRemoveSharedGroupMembersResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientReportAdActivityRequest : public FPlayFabRequestCommon
{
    EAdActivity Activity;                                                             // 0x0008 (size: 0x1)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    FString PlacementId;                                                              // 0x0018 (size: 0x10)
    FString RewardId;                                                                 // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FClientReportAdActivityResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientReportPlayerClientRequest : public FPlayFabRequestCommon
{
    FString Comment;                                                                  // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    FString ReporteeId;                                                               // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FClientReportPlayerClientResult : public FPlayFabResultCommon
{
    int32 SubmissionsRemaining;                                                       // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FClientRestoreIOSPurchasesRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    FString ReceiptData;                                                              // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FClientRestoreIOSPurchasesResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Fulfillments;                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientRewardAdActivityRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString PlacementId;                                                              // 0x0010 (size: 0x10)
    FString RewardId;                                                                 // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FClientRewardAdActivityResult : public FPlayFabResultCommon
{
    FString AdActivityEventId;                                                        // 0x0008 (size: 0x10)
    FString DebugResults;                                                             // 0x0018 (size: 0x10)
    FString PlacementId;                                                              // 0x0028 (size: 0x10)
    FString PlacementName;                                                            // 0x0038 (size: 0x10)
    int32 PlacementViewsRemaining;                                                    // 0x0048 (size: 0x4)
    int32 PlacementViewsResetMinutes;                                                 // 0x004C (size: 0x4)
    class UPlayFabJsonObject* RewardResults;                                          // 0x0050 (size: 0x8)

}; // Size: 0x58

struct FClientSendAccountRecoveryEmailRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString Email;                                                                    // 0x0010 (size: 0x10)
    FString EmailTemplateId;                                                          // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FClientSendAccountRecoveryEmailResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientSetFriendTagsRequest : public FPlayFabRequestCommon
{
    FString FriendPlayFabId;                                                          // 0x0008 (size: 0x10)
    FString Tags;                                                                     // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientSetFriendTagsResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientSetPlayerSecretRequest : public FPlayFabRequestCommon
{
    FString EncryptedRequest;                                                         // 0x0008 (size: 0x10)
    FString PlayerSecret;                                                             // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientSetPlayerSecretResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientStartGameRequest : public FPlayFabRequestCommon
{
    FString BuildVersion;                                                             // 0x0008 (size: 0x10)
    FString CharacterId;                                                              // 0x0018 (size: 0x10)
    FString CustomCommandLineData;                                                    // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0038 (size: 0x8)
    FString GameMode;                                                                 // 0x0040 (size: 0x10)
    ERegion Region;                                                                   // 0x0050 (size: 0x1)
    FString StatisticName;                                                            // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FClientStartGameResult : public FPlayFabResultCommon
{
    FString Expires;                                                                  // 0x0008 (size: 0x10)
    FString LobbyId;                                                                  // 0x0018 (size: 0x10)
    FString Password;                                                                 // 0x0028 (size: 0x10)
    FString ServerIPV4Address;                                                        // 0x0038 (size: 0x10)
    FString ServerIPV6Address;                                                        // 0x0048 (size: 0x10)
    int32 ServerPort;                                                                 // 0x0058 (size: 0x4)
    FString ServerPublicDNSName;                                                      // 0x0060 (size: 0x10)
    FString Ticket;                                                                   // 0x0070 (size: 0x10)

}; // Size: 0x80

struct FClientStartPurchaseRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    TArray<class UPlayFabJsonObject*> Items;                                          // 0x0020 (size: 0x10)
    FString StoreId;                                                                  // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FClientStartPurchaseResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Contents;                                       // 0x0008 (size: 0x10)
    FString OrderId;                                                                  // 0x0018 (size: 0x10)
    TArray<class UPlayFabJsonObject*> PaymentOptions;                                 // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* VirtualCurrencyBalances;                                // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FClientSubtractUserVirtualCurrencyRequest : public FPlayFabRequestCommon
{
    int32 Amount;                                                                     // 0x0008 (size: 0x4)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    FString VirtualCurrency;                                                          // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FClientUnlinkAndroidDeviceIDRequest : public FPlayFabRequestCommon
{
    FString AndroidDeviceId;                                                          // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FClientUnlinkAndroidDeviceIDResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientUnlinkAppleRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientUnlinkCustomIDRequest : public FPlayFabRequestCommon
{
    FString CustomId;                                                                 // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FClientUnlinkCustomIDResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientUnlinkFacebookAccountRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientUnlinkFacebookAccountResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientUnlinkFacebookInstantGamesIdRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString FacebookInstantGamesId;                                                   // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FClientUnlinkFacebookInstantGamesIdResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientUnlinkGameCenterAccountRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientUnlinkGameCenterAccountResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientUnlinkGoogleAccountRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientUnlinkGoogleAccountResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientUnlinkIOSDeviceIDRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString DeviceID;                                                                 // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FClientUnlinkIOSDeviceIDResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientUnlinkKongregateAccountRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientUnlinkKongregateAccountResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientUnlinkNintendoServiceAccountRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientUnlinkNintendoSwitchDeviceIdRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString NintendoSwitchDeviceId;                                                   // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FClientUnlinkNintendoSwitchDeviceIdResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientUnlinkOpenIdConnectRequest : public FPlayFabRequestCommon
{
    FString ConnectionId;                                                             // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FClientUnlinkPSNAccountRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientUnlinkPSNAccountResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientUnlinkSteamAccountRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientUnlinkSteamAccountResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientUnlinkTwitchAccountRequest : public FPlayFabRequestCommon
{
    FString AccessToken;                                                              // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FClientUnlinkTwitchAccountResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientUnlinkXboxAccountRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClientUnlinkXboxAccountResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientUnlockContainerInstanceRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    FString CharacterId;                                                              // 0x0018 (size: 0x10)
    FString ContainerItemInstanceId;                                                  // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0038 (size: 0x8)
    FString KeyItemInstanceId;                                                        // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FClientUnlockContainerItemRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    FString CharacterId;                                                              // 0x0018 (size: 0x10)
    FString ContainerItemId;                                                          // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FClientUnlockContainerItemResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> GrantedItems;                                   // 0x0008 (size: 0x10)
    FString UnlockedItemInstanceId;                                                   // 0x0018 (size: 0x10)
    FString UnlockedWithItemInstanceId;                                               // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* VirtualCurrency;                                        // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FClientUpdateAvatarUrlRequest : public FPlayFabRequestCommon
{
    FString ImageUrl;                                                                 // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientUpdateCharacterDataRequest : public FPlayFabRequestCommon
{
    FString CharacterId;                                                              // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    class UPlayFabJsonObject* Data;                                                   // 0x0020 (size: 0x8)
    FString KeysToRemove;                                                             // 0x0028 (size: 0x10)
    EUserDataPermission Permission;                                                   // 0x0038 (size: 0x1)

}; // Size: 0x40

struct FClientUpdateCharacterDataResult : public FPlayFabResultCommon
{
    int32 DataVersion;                                                                // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FClientUpdateCharacterStatisticsRequest : public FPlayFabRequestCommon
{
    FString CharacterId;                                                              // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CharacterStatistics;                                    // 0x0018 (size: 0x8)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FClientUpdateCharacterStatisticsResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientUpdatePlayerStatisticsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    TArray<class UPlayFabJsonObject*> Statistics;                                     // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FClientUpdatePlayerStatisticsResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientUpdateSharedGroupDataRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Data;                                                   // 0x0010 (size: 0x8)
    FString KeysToRemove;                                                             // 0x0018 (size: 0x10)
    EUserDataPermission Permission;                                                   // 0x0028 (size: 0x1)
    FString SharedGroupId;                                                            // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FClientUpdateSharedGroupDataResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FClientUpdateUserDataRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Data;                                                   // 0x0010 (size: 0x8)
    FString KeysToRemove;                                                             // 0x0018 (size: 0x10)
    EUserDataPermission Permission;                                                   // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FClientUpdateUserDataResult : public FPlayFabResultCommon
{
    int32 DataVersion;                                                                // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FClientUpdateUserTitleDisplayNameRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString DisplayName;                                                              // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FClientUpdateUserTitleDisplayNameResult : public FPlayFabResultCommon
{
    FString DisplayName;                                                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientValidateAmazonReceiptRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    FString CurrencyCode;                                                             // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0028 (size: 0x8)
    int32 PurchasePrice;                                                              // 0x0030 (size: 0x4)
    FString ReceiptId;                                                                // 0x0038 (size: 0x10)
    FString UserId;                                                                   // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FClientValidateAmazonReceiptResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Fulfillments;                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientValidateGooglePlayPurchaseRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    FString CurrencyCode;                                                             // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0028 (size: 0x8)
    int32 PurchasePrice;                                                              // 0x0030 (size: 0x4)
    FString ReceiptJson;                                                              // 0x0038 (size: 0x10)
    FString Signature;                                                                // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FClientValidateGooglePlayPurchaseResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Fulfillments;                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientValidateIOSReceiptRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    FString CurrencyCode;                                                             // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0028 (size: 0x8)
    int32 PurchasePrice;                                                              // 0x0030 (size: 0x4)
    FString ReceiptData;                                                              // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FClientValidateIOSReceiptResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Fulfillments;                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientValidateWindowsReceiptRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    FString CurrencyCode;                                                             // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0028 (size: 0x8)
    int32 PurchasePrice;                                                              // 0x0030 (size: 0x4)
    FString Receipt;                                                                  // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FClientValidateWindowsReceiptResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Fulfillments;                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientWriteClientCharacterEventRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* Body;                                                   // 0x0008 (size: 0x8)
    FString CharacterId;                                                              // 0x0010 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0020 (size: 0x8)
    FString EventName;                                                                // 0x0028 (size: 0x10)
    FString Timestamp;                                                                // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FClientWriteClientPlayerEventRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* Body;                                                   // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    FString EventName;                                                                // 0x0018 (size: 0x10)
    FString Timestamp;                                                                // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FClientWriteEventResponse : public FPlayFabResultCommon
{
    FString EventId;                                                                  // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientWriteTitleEventRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* Body;                                                   // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    FString EventName;                                                                // 0x0018 (size: 0x10)
    FString Timestamp;                                                                // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FCloudScriptEmptyResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FCloudScriptExecuteCloudScriptResult : public FPlayFabResultCommon
{
    int32 APIRequestsIssued;                                                          // 0x0008 (size: 0x4)
    class UPlayFabJsonObject* Error;                                                  // 0x0010 (size: 0x8)
    int32 ExecutionTimeSeconds;                                                       // 0x0018 (size: 0x4)
    FString FunctionName;                                                             // 0x0020 (size: 0x10)
    class UPlayFabJsonObject* FunctionResult;                                         // 0x0030 (size: 0x8)
    bool FunctionResultTooLarge;                                                      // 0x0038 (size: 0x1)
    int32 HttpRequestsIssued;                                                         // 0x003C (size: 0x4)
    TArray<class UPlayFabJsonObject*> Logs;                                           // 0x0040 (size: 0x10)
    bool LogsTooLarge;                                                                // 0x0050 (size: 0x1)
    int32 MemoryConsumedBytes;                                                        // 0x0054 (size: 0x4)
    int32 ProcessorTimeSeconds;                                                       // 0x0058 (size: 0x4)
    int32 Revision;                                                                   // 0x005C (size: 0x4)

}; // Size: 0x60

struct FCloudScriptExecuteEntityCloudScriptRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    FString FunctionName;                                                             // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* FunctionParameter;                                      // 0x0028 (size: 0x8)
    bool GeneratePlayStreamEvent;                                                     // 0x0030 (size: 0x1)
    ECloudScriptRevisionOption RevisionSelection;                                     // 0x0031 (size: 0x1)
    int32 SpecificRevision;                                                           // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FCloudScriptExecuteFunctionRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    FString FunctionName;                                                             // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* FunctionParameter;                                      // 0x0028 (size: 0x8)
    bool GeneratePlayStreamEvent;                                                     // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FCloudScriptExecuteFunctionResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Error;                                                  // 0x0008 (size: 0x8)
    int32 ExecutionTimeMilliseconds;                                                  // 0x0010 (size: 0x4)
    FString FunctionName;                                                             // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* FunctionResult;                                         // 0x0028 (size: 0x8)
    bool FunctionResultTooLarge;                                                      // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FCloudScriptListFunctionsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FCloudScriptListFunctionsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Functions;                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FCloudScriptListHttpFunctionsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Functions;                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FCloudScriptListQueuedFunctionsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Functions;                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FCloudScriptPostFunctionResultForEntityTriggeredActionRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    class UPlayFabJsonObject* FunctionResult;                                         // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FCloudScriptPostFunctionResultForFunctionExecutionRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    class UPlayFabJsonObject* FunctionResult;                                         // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FCloudScriptPostFunctionResultForPlayerTriggeredActionRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    class UPlayFabJsonObject* FunctionResult;                                         // 0x0018 (size: 0x8)
    class UPlayFabJsonObject* PlayerProfile;                                          // 0x0020 (size: 0x8)
    class UPlayFabJsonObject* PlayStreamEventEnvelope;                                // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FCloudScriptPostFunctionResultForScheduledTaskRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    class UPlayFabJsonObject* FunctionResult;                                         // 0x0018 (size: 0x8)
    class UPlayFabJsonObject* ScheduledTaskId;                                        // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FCloudScriptRegisterHttpFunctionRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString FunctionName;                                                             // 0x0010 (size: 0x10)
    FString FunctionUrl;                                                              // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FCloudScriptRegisterQueuedFunctionRequest : public FPlayFabRequestCommon
{
    FString ConnectionString;                                                         // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    FString FunctionName;                                                             // 0x0020 (size: 0x10)
    FString QueueName;                                                                // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FCloudScriptUnregisterFunctionRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString FunctionName;                                                             // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FDataAbortFileUploadsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    FString FileNames;                                                                // 0x0018 (size: 0x10)
    int32 ProfileVersion;                                                             // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FDataAbortFileUploadsResponse : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Entity;                                                 // 0x0008 (size: 0x8)
    int32 ProfileVersion;                                                             // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FDataDeleteFilesRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    FString FileNames;                                                                // 0x0018 (size: 0x10)
    int32 ProfileVersion;                                                             // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FDataDeleteFilesResponse : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Entity;                                                 // 0x0008 (size: 0x8)
    int32 ProfileVersion;                                                             // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FDataFinalizeFileUploadsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    FString FileNames;                                                                // 0x0018 (size: 0x10)
    int32 ProfileVersion;                                                             // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FDataFinalizeFileUploadsResponse : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Entity;                                                 // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* MetaData;                                               // 0x0010 (size: 0x8)
    int32 ProfileVersion;                                                             // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FDataGetFilesRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FDataGetFilesResponse : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Entity;                                                 // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* MetaData;                                               // 0x0010 (size: 0x8)
    int32 ProfileVersion;                                                             // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FDataGetObjectsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    bool EscapeObject;                                                                // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FDataGetObjectsResponse : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Entity;                                                 // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Objects;                                                // 0x0010 (size: 0x8)
    int32 ProfileVersion;                                                             // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FDataInitiateFileUploadsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    FString FileNames;                                                                // 0x0018 (size: 0x10)
    int32 ProfileVersion;                                                             // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FDataInitiateFileUploadsResponse : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Entity;                                                 // 0x0008 (size: 0x8)
    int32 ProfileVersion;                                                             // 0x0010 (size: 0x4)
    TArray<class UPlayFabJsonObject*> UploadDetails;                                  // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FDataSetObjectsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    int32 ExpectedProfileVersion;                                                     // 0x0018 (size: 0x4)
    TArray<class UPlayFabJsonObject*> Objects;                                        // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FDataSetObjectsResponse : public FPlayFabResultCommon
{
    int32 ProfileVersion;                                                             // 0x0008 (size: 0x4)
    TArray<class UPlayFabJsonObject*> SetResults;                                     // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FEventsWriteEventsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    TArray<class UPlayFabJsonObject*> Events;                                         // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FEventsWriteEventsResponse : public FPlayFabResultCommon
{
    FString AssignedEventIds;                                                         // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FExperimentationCreateExclusionGroupRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString Description;                                                              // 0x0010 (size: 0x10)
    FString Name;                                                                     // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FExperimentationCreateExclusionGroupResult : public FPlayFabResultCommon
{
    FString ExclusionGroupId;                                                         // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FExperimentationCreateExperimentRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString Description;                                                              // 0x0010 (size: 0x10)
    FString EndDate;                                                                  // 0x0020 (size: 0x10)
    FString ExclusionGroupId;                                                         // 0x0030 (size: 0x10)
    int32 ExclusionGroupTrafficAllocation;                                            // 0x0040 (size: 0x4)
    EExperimentType ExperimentType;                                                   // 0x0044 (size: 0x1)
    FString Name;                                                                     // 0x0048 (size: 0x10)
    FString SegmentId;                                                                // 0x0058 (size: 0x10)
    FString StartDate;                                                                // 0x0068 (size: 0x10)
    FString TitlePlayerAccountTestIds;                                                // 0x0078 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Variants;                                       // 0x0088 (size: 0x10)

}; // Size: 0x98

struct FExperimentationCreateExperimentResult : public FPlayFabResultCommon
{
    FString ExperimentId;                                                             // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FExperimentationDeleteExclusionGroupRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString ExclusionGroupId;                                                         // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FExperimentationDeleteExperimentRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString ExperimentId;                                                             // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FExperimentationEmptyResponse : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FExperimentationGetExclusionGroupTrafficRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString ExclusionGroupId;                                                         // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FExperimentationGetExclusionGroupTrafficResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> TrafficAllocations;                             // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FExperimentationGetExclusionGroupsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FExperimentationGetExclusionGroupsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> ExclusionGroups;                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FExperimentationGetExperimentsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FExperimentationGetExperimentsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Experiments;                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FExperimentationGetLatestScorecardRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString ExperimentId;                                                             // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FExperimentationGetLatestScorecardResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Scorecard;                                              // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FExperimentationGetTreatmentAssignmentRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FExperimentationGetTreatmentAssignmentResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* TreatmentAssignment;                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FExperimentationStartExperimentRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString ExperimentId;                                                             // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FExperimentationStopExperimentRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString ExperimentId;                                                             // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FExperimentationUpdateExclusionGroupRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString Description;                                                              // 0x0010 (size: 0x10)
    FString ExclusionGroupId;                                                         // 0x0020 (size: 0x10)
    FString Name;                                                                     // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FExperimentationUpdateExperimentRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString Description;                                                              // 0x0010 (size: 0x10)
    FString EndDate;                                                                  // 0x0020 (size: 0x10)
    FString ExclusionGroupId;                                                         // 0x0030 (size: 0x10)
    int32 ExclusionGroupTrafficAllocation;                                            // 0x0040 (size: 0x4)
    EExperimentType ExperimentType;                                                   // 0x0044 (size: 0x1)
    FString ID;                                                                       // 0x0048 (size: 0x10)
    FString Name;                                                                     // 0x0058 (size: 0x10)
    FString SegmentId;                                                                // 0x0068 (size: 0x10)
    FString StartDate;                                                                // 0x0078 (size: 0x10)
    FString TitlePlayerAccountTestIds;                                                // 0x0088 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Variants;                                       // 0x0098 (size: 0x10)

}; // Size: 0xA8

struct FGroupsAcceptGroupApplicationRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    class UPlayFabJsonObject* Group;                                                  // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FGroupsAcceptGroupInvitationRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    class UPlayFabJsonObject* Group;                                                  // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FGroupsAddMembersRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Group;                                                  // 0x0010 (size: 0x8)
    TArray<class UPlayFabJsonObject*> Members;                                        // 0x0018 (size: 0x10)
    FString RoleId;                                                                   // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FGroupsApplyToGroupRequest : public FPlayFabRequestCommon
{
    bool AutoAcceptOutstandingInvite;                                                 // 0x0008 (size: 0x1)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0018 (size: 0x8)
    class UPlayFabJsonObject* Group;                                                  // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FGroupsApplyToGroupResponse : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Entity;                                                 // 0x0008 (size: 0x8)
    FString Expires;                                                                  // 0x0010 (size: 0x10)
    class UPlayFabJsonObject* Group;                                                  // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FGroupsBlockEntityRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    class UPlayFabJsonObject* Group;                                                  // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FGroupsChangeMemberRoleRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString DestinationRoleId;                                                        // 0x0010 (size: 0x10)
    class UPlayFabJsonObject* Group;                                                  // 0x0020 (size: 0x8)
    TArray<class UPlayFabJsonObject*> Members;                                        // 0x0028 (size: 0x10)
    FString OriginRoleId;                                                             // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FGroupsCreateGroupRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    FString GroupName;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FGroupsCreateGroupResponse : public FPlayFabResultCommon
{
    FString AdminRoleId;                                                              // 0x0008 (size: 0x10)
    FString Created;                                                                  // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* Group;                                                  // 0x0028 (size: 0x8)
    FString GroupName;                                                                // 0x0030 (size: 0x10)
    FString MemberRoleId;                                                             // 0x0040 (size: 0x10)
    int32 ProfileVersion;                                                             // 0x0050 (size: 0x4)
    class UPlayFabJsonObject* Roles;                                                  // 0x0058 (size: 0x8)

}; // Size: 0x60

struct FGroupsCreateGroupRoleRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Group;                                                  // 0x0010 (size: 0x8)
    FString RoleId;                                                                   // 0x0018 (size: 0x10)
    FString RoleName;                                                                 // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FGroupsCreateGroupRoleResponse : public FPlayFabResultCommon
{
    int32 ProfileVersion;                                                             // 0x0008 (size: 0x4)
    FString RoleId;                                                                   // 0x0010 (size: 0x10)
    FString RoleName;                                                                 // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FGroupsDeleteGroupRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Group;                                                  // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FGroupsDeleteRoleRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Group;                                                  // 0x0010 (size: 0x8)
    FString RoleId;                                                                   // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FGroupsEmptyResponse : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FGroupsGetGroupRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Group;                                                  // 0x0010 (size: 0x8)
    FString GroupName;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FGroupsGetGroupResponse : public FPlayFabResultCommon
{
    FString AdminRoleId;                                                              // 0x0008 (size: 0x10)
    FString Created;                                                                  // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* Group;                                                  // 0x0028 (size: 0x8)
    FString GroupName;                                                                // 0x0030 (size: 0x10)
    FString MemberRoleId;                                                             // 0x0040 (size: 0x10)
    int32 ProfileVersion;                                                             // 0x0050 (size: 0x4)
    class UPlayFabJsonObject* Roles;                                                  // 0x0058 (size: 0x8)

}; // Size: 0x60

struct FGroupsInviteToGroupRequest : public FPlayFabRequestCommon
{
    bool AutoAcceptOutstandingApplication;                                            // 0x0008 (size: 0x1)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0018 (size: 0x8)
    class UPlayFabJsonObject* Group;                                                  // 0x0020 (size: 0x8)
    FString RoleId;                                                                   // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FGroupsInviteToGroupResponse : public FPlayFabResultCommon
{
    FString Expires;                                                                  // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* Group;                                                  // 0x0018 (size: 0x8)
    class UPlayFabJsonObject* InvitedByEntity;                                        // 0x0020 (size: 0x8)
    class UPlayFabJsonObject* InvitedEntity;                                          // 0x0028 (size: 0x8)
    FString RoleId;                                                                   // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FGroupsIsMemberRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    class UPlayFabJsonObject* Group;                                                  // 0x0018 (size: 0x8)
    FString RoleId;                                                                   // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FGroupsIsMemberResponse : public FPlayFabResultCommon
{
    bool IsMember;                                                                    // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FGroupsListGroupApplicationsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Group;                                                  // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FGroupsListGroupApplicationsResponse : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Applications;                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FGroupsListGroupBlocksRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Group;                                                  // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FGroupsListGroupBlocksResponse : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> BlockedEntities;                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FGroupsListGroupInvitationsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Group;                                                  // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FGroupsListGroupInvitationsResponse : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Invitations;                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FGroupsListGroupMembersRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Group;                                                  // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FGroupsListGroupMembersResponse : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Members;                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FGroupsListMembershipOpportunitiesRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FGroupsListMembershipOpportunitiesResponse : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Applications;                                   // 0x0008 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Invitations;                                    // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FGroupsListMembershipRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FGroupsListMembershipResponse : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Groups;                                         // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FGroupsRemoveGroupApplicationRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    class UPlayFabJsonObject* Group;                                                  // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FGroupsRemoveGroupInvitationRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    class UPlayFabJsonObject* Group;                                                  // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FGroupsRemoveMembersRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Group;                                                  // 0x0010 (size: 0x8)
    TArray<class UPlayFabJsonObject*> Members;                                        // 0x0018 (size: 0x10)
    FString RoleId;                                                                   // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FGroupsUnblockEntityRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    class UPlayFabJsonObject* Group;                                                  // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FGroupsUpdateGroupRequest : public FPlayFabRequestCommon
{
    FString AdminRoleId;                                                              // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    int32 ExpectedProfileVersion;                                                     // 0x0020 (size: 0x4)
    class UPlayFabJsonObject* Group;                                                  // 0x0028 (size: 0x8)
    FString GroupName;                                                                // 0x0030 (size: 0x10)
    FString MemberRoleId;                                                             // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FGroupsUpdateGroupResponse : public FPlayFabResultCommon
{
    FString OperationReason;                                                          // 0x0008 (size: 0x10)
    int32 ProfileVersion;                                                             // 0x0018 (size: 0x4)
    EOperationTypes SetResult;                                                        // 0x001C (size: 0x1)

}; // Size: 0x20

struct FGroupsUpdateGroupRoleRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    int32 ExpectedProfileVersion;                                                     // 0x0010 (size: 0x4)
    class UPlayFabJsonObject* Group;                                                  // 0x0018 (size: 0x8)
    FString RoleId;                                                                   // 0x0020 (size: 0x10)
    FString RoleName;                                                                 // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FGroupsUpdateGroupRoleResponse : public FPlayFabResultCommon
{
    FString OperationReason;                                                          // 0x0008 (size: 0x10)
    int32 ProfileVersion;                                                             // 0x0018 (size: 0x4)
    EOperationTypes SetResult;                                                        // 0x001C (size: 0x1)

}; // Size: 0x20

struct FInsightsInsightsEmptyRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FInsightsInsightsGetDetailsResponse : public FPlayFabResultCommon
{
    int32 DataUsageMb;                                                                // 0x0008 (size: 0x4)
    FString ErrorMessage;                                                             // 0x0010 (size: 0x10)
    class UPlayFabJsonObject* Limits;                                                 // 0x0020 (size: 0x8)
    TArray<class UPlayFabJsonObject*> PendingOperations;                              // 0x0028 (size: 0x10)
    int32 PerformanceLevel;                                                           // 0x0038 (size: 0x4)
    int32 RetentionDays;                                                              // 0x003C (size: 0x4)

}; // Size: 0x40

struct FInsightsInsightsGetLimitsResponse : public FPlayFabResultCommon
{
    int32 DefaultPerformanceLevel;                                                    // 0x0008 (size: 0x4)
    int32 DefaultStorageRetentionDays;                                                // 0x000C (size: 0x4)
    int32 StorageMaxRetentionDays;                                                    // 0x0010 (size: 0x4)
    int32 StorageMinRetentionDays;                                                    // 0x0014 (size: 0x4)
    TArray<class UPlayFabJsonObject*> SubMeters;                                      // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FInsightsInsightsGetOperationStatusRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString OperationId;                                                              // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FInsightsInsightsGetOperationStatusResponse : public FPlayFabResultCommon
{
    FString Message;                                                                  // 0x0008 (size: 0x10)
    FString OperationCompletedTime;                                                   // 0x0018 (size: 0x10)
    FString OperationId;                                                              // 0x0028 (size: 0x10)
    FString OperationLastUpdated;                                                     // 0x0038 (size: 0x10)
    FString OperationStartedTime;                                                     // 0x0048 (size: 0x10)
    FString OperationType;                                                            // 0x0058 (size: 0x10)
    int32 OperationValue;                                                             // 0x0068 (size: 0x4)
    FString Status;                                                                   // 0x0070 (size: 0x10)

}; // Size: 0x80

struct FInsightsInsightsGetPendingOperationsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString OperationType;                                                            // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FInsightsInsightsGetPendingOperationsResponse : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> PendingOperations;                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FInsightsInsightsOperationResponse : public FPlayFabResultCommon
{
    FString Message;                                                                  // 0x0008 (size: 0x10)
    FString OperationId;                                                              // 0x0018 (size: 0x10)
    FString OperationType;                                                            // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FInsightsInsightsSetPerformanceRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    int32 PerformanceLevel;                                                           // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FInsightsInsightsSetStorageRetentionRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    int32 RetentionDays;                                                              // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FLocalizationGetLanguageListRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FLocalizationGetLanguageListResponse : public FPlayFabResultCommon
{
    FString LanguageList;                                                             // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FMatchmakerAuthUserRequest : public FPlayFabRequestCommon
{
    FString AuthorizationTicket;                                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FMatchmakerAuthUserResponse : public FPlayFabResultCommon
{
    bool Authorized;                                                                  // 0x0008 (size: 0x1)
    FString PlayFabId;                                                                // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FMatchmakerPlayerJoinedRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString LobbyId;                                                                  // 0x0010 (size: 0x10)
    FString PlayFabId;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FMatchmakerPlayerJoinedResponse : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FMatchmakerPlayerLeftRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString LobbyId;                                                                  // 0x0010 (size: 0x10)
    FString PlayFabId;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FMatchmakerPlayerLeftResponse : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FMatchmakerStartGameRequest : public FPlayFabRequestCommon
{
    FString Build;                                                                    // 0x0008 (size: 0x10)
    FString CustomCommandLineData;                                                    // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0028 (size: 0x8)
    FString ExternalMatchmakerEventEndpoint;                                          // 0x0030 (size: 0x10)
    FString GameMode;                                                                 // 0x0040 (size: 0x10)
    ERegion Region;                                                                   // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FMatchmakerStartGameResponse : public FPlayFabResultCommon
{
    FString GameID;                                                                   // 0x0008 (size: 0x10)
    FString ServerIPV4Address;                                                        // 0x0018 (size: 0x10)
    FString ServerIPV6Address;                                                        // 0x0028 (size: 0x10)
    int32 ServerPort;                                                                 // 0x0038 (size: 0x4)
    FString ServerPublicDNSName;                                                      // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FMatchmakerUserInfoRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    int32 MinCatalogVersion;                                                          // 0x0010 (size: 0x4)
    FString PlayFabId;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FMatchmakerUserInfoResponse : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Inventory;                                      // 0x0008 (size: 0x10)
    bool IsDeveloper;                                                                 // 0x0018 (size: 0x1)
    FString PlayFabId;                                                                // 0x0020 (size: 0x10)
    FString SteamID;                                                                  // 0x0030 (size: 0x10)
    FString TitleDisplayName;                                                         // 0x0040 (size: 0x10)
    FString Username;                                                                 // 0x0050 (size: 0x10)
    class UPlayFabJsonObject* VirtualCurrency;                                        // 0x0060 (size: 0x8)
    class UPlayFabJsonObject* VirtualCurrencyRechargeTimes;                           // 0x0068 (size: 0x8)

}; // Size: 0x70

struct FMultiplayerBuildAliasDetailsResponse : public FPlayFabResultCommon
{
    FString AliasId;                                                                  // 0x0008 (size: 0x10)
    FString AliasName;                                                                // 0x0018 (size: 0x10)
    TArray<class UPlayFabJsonObject*> BuildSelectionCriteria;                         // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FMultiplayerCancelAllMatchmakingTicketsForPlayerRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    FString QueueName;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FMultiplayerCancelAllMatchmakingTicketsForPlayerResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FMultiplayerCancelAllServerBackfillTicketsForPlayerRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    FString QueueName;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FMultiplayerCancelAllServerBackfillTicketsForPlayerResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FMultiplayerCancelMatchmakingTicketRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString QueueName;                                                                // 0x0010 (size: 0x10)
    FString TicketId;                                                                 // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FMultiplayerCancelMatchmakingTicketResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FMultiplayerCancelServerBackfillTicketRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString QueueName;                                                                // 0x0010 (size: 0x10)
    FString TicketId;                                                                 // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FMultiplayerCancelServerBackfillTicketResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FMultiplayerCreateBuildAliasRequest : public FPlayFabRequestCommon
{
    FString AliasName;                                                                // 0x0008 (size: 0x10)
    TArray<class UPlayFabJsonObject*> BuildSelectionCriteria;                         // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FMultiplayerCreateBuildWithCustomContainerRequest : public FPlayFabRequestCommon
{
    bool AreAssetsReadonly;                                                           // 0x0008 (size: 0x1)
    FString BuildName;                                                                // 0x0010 (size: 0x10)
    EContainerFlavor ContainerFlavor;                                                 // 0x0020 (size: 0x1)
    class UPlayFabJsonObject* ContainerImageReference;                                // 0x0028 (size: 0x8)
    FString ContainerRunCommand;                                                      // 0x0030 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0040 (size: 0x8)
    TArray<class UPlayFabJsonObject*> GameAssetReferences;                            // 0x0048 (size: 0x10)
    TArray<class UPlayFabJsonObject*> GameCertificateReferences;                      // 0x0058 (size: 0x10)
    class UPlayFabJsonObject* LinuxInstrumentationConfiguration;                      // 0x0068 (size: 0x8)
    class UPlayFabJsonObject* MetaData;                                               // 0x0070 (size: 0x8)
    int32 MultiplayerServerCountPerVm;                                                // 0x0078 (size: 0x4)
    TArray<class UPlayFabJsonObject*> Ports;                                          // 0x0080 (size: 0x10)
    TArray<class UPlayFabJsonObject*> RegionConfigurations;                           // 0x0090 (size: 0x10)
    bool UseStreamingForAssetDownloads;                                               // 0x00A0 (size: 0x1)
    EAzureVmSize VmSize;                                                              // 0x00A1 (size: 0x1)

}; // Size: 0xA8

struct FMultiplayerCreateBuildWithCustomContainerResponse : public FPlayFabResultCommon
{
    bool AreAssetsReadonly;                                                           // 0x0008 (size: 0x1)
    FString BuildId;                                                                  // 0x0010 (size: 0x10)
    FString BuildName;                                                                // 0x0020 (size: 0x10)
    EContainerFlavor ContainerFlavor;                                                 // 0x0030 (size: 0x1)
    FString ContainerRunCommand;                                                      // 0x0038 (size: 0x10)
    FString CreationTime;                                                             // 0x0048 (size: 0x10)
    class UPlayFabJsonObject* CustomGameContainerImage;                               // 0x0058 (size: 0x8)
    TArray<class UPlayFabJsonObject*> GameAssetReferences;                            // 0x0060 (size: 0x10)
    TArray<class UPlayFabJsonObject*> GameCertificateReferences;                      // 0x0070 (size: 0x10)
    class UPlayFabJsonObject* LinuxInstrumentationConfiguration;                      // 0x0080 (size: 0x8)
    class UPlayFabJsonObject* MetaData;                                               // 0x0088 (size: 0x8)
    int32 MultiplayerServerCountPerVm;                                                // 0x0090 (size: 0x4)
    FString OsPlatform;                                                               // 0x0098 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Ports;                                          // 0x00A8 (size: 0x10)
    TArray<class UPlayFabJsonObject*> RegionConfigurations;                           // 0x00B8 (size: 0x10)
    FString ServerType;                                                               // 0x00C8 (size: 0x10)
    bool UseStreamingForAssetDownloads;                                               // 0x00D8 (size: 0x1)
    EAzureVmSize VmSize;                                                              // 0x00D9 (size: 0x1)

}; // Size: 0xE0

struct FMultiplayerCreateBuildWithManagedContainerRequest : public FPlayFabRequestCommon
{
    bool AreAssetsReadonly;                                                           // 0x0008 (size: 0x1)
    FString BuildName;                                                                // 0x0010 (size: 0x10)
    EContainerFlavor ContainerFlavor;                                                 // 0x0020 (size: 0x1)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0028 (size: 0x8)
    TArray<class UPlayFabJsonObject*> GameAssetReferences;                            // 0x0030 (size: 0x10)
    TArray<class UPlayFabJsonObject*> GameCertificateReferences;                      // 0x0040 (size: 0x10)
    FString GameWorkingDirectory;                                                     // 0x0050 (size: 0x10)
    class UPlayFabJsonObject* InstrumentationConfiguration;                           // 0x0060 (size: 0x8)
    class UPlayFabJsonObject* MetaData;                                               // 0x0068 (size: 0x8)
    int32 MultiplayerServerCountPerVm;                                                // 0x0070 (size: 0x4)
    TArray<class UPlayFabJsonObject*> Ports;                                          // 0x0078 (size: 0x10)
    TArray<class UPlayFabJsonObject*> RegionConfigurations;                           // 0x0088 (size: 0x10)
    FString StartMultiplayerServerCommand;                                            // 0x0098 (size: 0x10)
    bool UseStreamingForAssetDownloads;                                               // 0x00A8 (size: 0x1)
    EAzureVmSize VmSize;                                                              // 0x00A9 (size: 0x1)

}; // Size: 0xB0

struct FMultiplayerCreateBuildWithManagedContainerResponse : public FPlayFabResultCommon
{
    bool AreAssetsReadonly;                                                           // 0x0008 (size: 0x1)
    FString BuildId;                                                                  // 0x0010 (size: 0x10)
    FString BuildName;                                                                // 0x0020 (size: 0x10)
    EContainerFlavor ContainerFlavor;                                                 // 0x0030 (size: 0x1)
    FString CreationTime;                                                             // 0x0038 (size: 0x10)
    TArray<class UPlayFabJsonObject*> GameAssetReferences;                            // 0x0048 (size: 0x10)
    TArray<class UPlayFabJsonObject*> GameCertificateReferences;                      // 0x0058 (size: 0x10)
    FString GameWorkingDirectory;                                                     // 0x0068 (size: 0x10)
    class UPlayFabJsonObject* InstrumentationConfiguration;                           // 0x0078 (size: 0x8)
    class UPlayFabJsonObject* MetaData;                                               // 0x0080 (size: 0x8)
    int32 MultiplayerServerCountPerVm;                                                // 0x0088 (size: 0x4)
    FString OsPlatform;                                                               // 0x0090 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Ports;                                          // 0x00A0 (size: 0x10)
    TArray<class UPlayFabJsonObject*> RegionConfigurations;                           // 0x00B0 (size: 0x10)
    FString ServerType;                                                               // 0x00C0 (size: 0x10)
    FString StartMultiplayerServerCommand;                                            // 0x00D0 (size: 0x10)
    bool UseStreamingForAssetDownloads;                                               // 0x00E0 (size: 0x1)
    EAzureVmSize VmSize;                                                              // 0x00E1 (size: 0x1)

}; // Size: 0xE8

struct FMultiplayerCreateBuildWithProcessBasedServerRequest : public FPlayFabRequestCommon
{
    bool AreAssetsReadonly;                                                           // 0x0008 (size: 0x1)
    FString BuildName;                                                                // 0x0010 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0020 (size: 0x8)
    TArray<class UPlayFabJsonObject*> GameAssetReferences;                            // 0x0028 (size: 0x10)
    TArray<class UPlayFabJsonObject*> GameCertificateReferences;                      // 0x0038 (size: 0x10)
    FString GameWorkingDirectory;                                                     // 0x0048 (size: 0x10)
    class UPlayFabJsonObject* InstrumentationConfiguration;                           // 0x0058 (size: 0x8)
    bool IsOSPreview;                                                                 // 0x0060 (size: 0x1)
    class UPlayFabJsonObject* MetaData;                                               // 0x0068 (size: 0x8)
    int32 MultiplayerServerCountPerVm;                                                // 0x0070 (size: 0x4)
    FString OsPlatform;                                                               // 0x0078 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Ports;                                          // 0x0088 (size: 0x10)
    TArray<class UPlayFabJsonObject*> RegionConfigurations;                           // 0x0098 (size: 0x10)
    FString StartMultiplayerServerCommand;                                            // 0x00A8 (size: 0x10)
    bool UseStreamingForAssetDownloads;                                               // 0x00B8 (size: 0x1)
    EAzureVmSize VmSize;                                                              // 0x00B9 (size: 0x1)

}; // Size: 0xC0

struct FMultiplayerCreateBuildWithProcessBasedServerResponse : public FPlayFabResultCommon
{
    bool AreAssetsReadonly;                                                           // 0x0008 (size: 0x1)
    FString BuildId;                                                                  // 0x0010 (size: 0x10)
    FString BuildName;                                                                // 0x0020 (size: 0x10)
    EContainerFlavor ContainerFlavor;                                                 // 0x0030 (size: 0x1)
    FString CreationTime;                                                             // 0x0038 (size: 0x10)
    TArray<class UPlayFabJsonObject*> GameAssetReferences;                            // 0x0048 (size: 0x10)
    TArray<class UPlayFabJsonObject*> GameCertificateReferences;                      // 0x0058 (size: 0x10)
    FString GameWorkingDirectory;                                                     // 0x0068 (size: 0x10)
    class UPlayFabJsonObject* InstrumentationConfiguration;                           // 0x0078 (size: 0x8)
    bool IsOSPreview;                                                                 // 0x0080 (size: 0x1)
    class UPlayFabJsonObject* MetaData;                                               // 0x0088 (size: 0x8)
    int32 MultiplayerServerCountPerVm;                                                // 0x0090 (size: 0x4)
    FString OsPlatform;                                                               // 0x0098 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Ports;                                          // 0x00A8 (size: 0x10)
    TArray<class UPlayFabJsonObject*> RegionConfigurations;                           // 0x00B8 (size: 0x10)
    FString ServerType;                                                               // 0x00C8 (size: 0x10)
    FString StartMultiplayerServerCommand;                                            // 0x00D8 (size: 0x10)
    bool UseStreamingForAssetDownloads;                                               // 0x00E8 (size: 0x1)
    EAzureVmSize VmSize;                                                              // 0x00E9 (size: 0x1)

}; // Size: 0xF0

struct FMultiplayerCreateMatchmakingTicketRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* Creator;                                                // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    int32 GiveUpAfterSeconds;                                                         // 0x0018 (size: 0x4)
    TArray<class UPlayFabJsonObject*> MembersToMatchWith;                             // 0x0020 (size: 0x10)
    FString QueueName;                                                                // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FMultiplayerCreateMatchmakingTicketResult : public FPlayFabResultCommon
{
    FString TicketId;                                                                 // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FMultiplayerCreateRemoteUserRequest : public FPlayFabRequestCommon
{
    FString BuildId;                                                                  // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    FString ExpirationTime;                                                           // 0x0020 (size: 0x10)
    FString Region;                                                                   // 0x0030 (size: 0x10)
    FString Username;                                                                 // 0x0040 (size: 0x10)
    FString VmId;                                                                     // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FMultiplayerCreateRemoteUserResponse : public FPlayFabResultCommon
{
    FString ExpirationTime;                                                           // 0x0008 (size: 0x10)
    FString Password;                                                                 // 0x0018 (size: 0x10)
    FString Username;                                                                 // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FMultiplayerCreateServerBackfillTicketRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    int32 GiveUpAfterSeconds;                                                         // 0x0010 (size: 0x4)
    TArray<class UPlayFabJsonObject*> Members;                                        // 0x0018 (size: 0x10)
    FString QueueName;                                                                // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* ServerDetails;                                          // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FMultiplayerCreateServerBackfillTicketResult : public FPlayFabResultCommon
{
    FString TicketId;                                                                 // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FMultiplayerCreateServerMatchmakingTicketRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    int32 GiveUpAfterSeconds;                                                         // 0x0010 (size: 0x4)
    TArray<class UPlayFabJsonObject*> Members;                                        // 0x0018 (size: 0x10)
    FString QueueName;                                                                // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FMultiplayerCreateTitleMultiplayerServersQuotaChangeRequest : public FPlayFabRequestCommon
{
    FString ChangeDescription;                                                        // 0x0008 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Changes;                                        // 0x0018 (size: 0x10)
    FString ContactEmail;                                                             // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0038 (size: 0x8)
    FString Notes;                                                                    // 0x0040 (size: 0x10)
    FString StartDate;                                                                // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FMultiplayerCreateTitleMultiplayerServersQuotaChangeResponse : public FPlayFabResultCommon
{
    FString RequestId;                                                                // 0x0008 (size: 0x10)
    bool WasApproved;                                                                 // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FMultiplayerDeleteAssetRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString Filename;                                                                 // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FMultiplayerDeleteBuildAliasRequest : public FPlayFabRequestCommon
{
    FString AliasId;                                                                  // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FMultiplayerDeleteBuildRegionRequest : public FPlayFabRequestCommon
{
    FString BuildId;                                                                  // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    FString Region;                                                                   // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FMultiplayerDeleteBuildRequest : public FPlayFabRequestCommon
{
    FString BuildId;                                                                  // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FMultiplayerDeleteCertificateRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString Name;                                                                     // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FMultiplayerDeleteContainerImageRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString ImageName;                                                                // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FMultiplayerDeleteRemoteUserRequest : public FPlayFabRequestCommon
{
    FString BuildId;                                                                  // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    FString Region;                                                                   // 0x0020 (size: 0x10)
    FString Username;                                                                 // 0x0030 (size: 0x10)
    FString VmId;                                                                     // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FMultiplayerEmptyResponse : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FMultiplayerEnableMultiplayerServersForTitleRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FMultiplayerEnableMultiplayerServersForTitleResponse : public FPlayFabResultCommon
{
    ETitleMultiplayerServerEnabledStatus Status;                                      // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FMultiplayerGetAssetDownloadUrlRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString Filename;                                                                 // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FMultiplayerGetAssetDownloadUrlResponse : public FPlayFabResultCommon
{
    FString AssetDownloadUrl;                                                         // 0x0008 (size: 0x10)
    FString Filename;                                                                 // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FMultiplayerGetAssetUploadUrlRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString Filename;                                                                 // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FMultiplayerGetAssetUploadUrlResponse : public FPlayFabResultCommon
{
    FString AssetUploadUrl;                                                           // 0x0008 (size: 0x10)
    FString Filename;                                                                 // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FMultiplayerGetBuildAliasRequest : public FPlayFabRequestCommon
{
    FString AliasId;                                                                  // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FMultiplayerGetBuildRequest : public FPlayFabRequestCommon
{
    FString BuildId;                                                                  // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FMultiplayerGetBuildResponse : public FPlayFabResultCommon
{
    bool AreAssetsReadonly;                                                           // 0x0008 (size: 0x1)
    FString BuildId;                                                                  // 0x0010 (size: 0x10)
    FString BuildName;                                                                // 0x0020 (size: 0x10)
    FString BuildStatus;                                                              // 0x0030 (size: 0x10)
    EContainerFlavor ContainerFlavor;                                                 // 0x0040 (size: 0x1)
    FString ContainerRunCommand;                                                      // 0x0048 (size: 0x10)
    FString CreationTime;                                                             // 0x0058 (size: 0x10)
    class UPlayFabJsonObject* CustomGameContainerImage;                               // 0x0068 (size: 0x8)
    TArray<class UPlayFabJsonObject*> GameAssetReferences;                            // 0x0070 (size: 0x10)
    TArray<class UPlayFabJsonObject*> GameCertificateReferences;                      // 0x0080 (size: 0x10)
    class UPlayFabJsonObject* InstrumentationConfiguration;                           // 0x0090 (size: 0x8)
    class UPlayFabJsonObject* MetaData;                                               // 0x0098 (size: 0x8)
    int32 MultiplayerServerCountPerVm;                                                // 0x00A0 (size: 0x4)
    FString OsPlatform;                                                               // 0x00A8 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Ports;                                          // 0x00B8 (size: 0x10)
    TArray<class UPlayFabJsonObject*> RegionConfigurations;                           // 0x00C8 (size: 0x10)
    FString ServerType;                                                               // 0x00D8 (size: 0x10)
    FString StartMultiplayerServerCommand;                                            // 0x00E8 (size: 0x10)
    bool UseStreamingForAssetDownloads;                                               // 0x00F8 (size: 0x1)
    EAzureVmSize VmSize;                                                              // 0x00F9 (size: 0x1)

}; // Size: 0x100

struct FMultiplayerGetContainerRegistryCredentialsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FMultiplayerGetContainerRegistryCredentialsResponse : public FPlayFabResultCommon
{
    FString DnsName;                                                                  // 0x0008 (size: 0x10)
    FString Password;                                                                 // 0x0018 (size: 0x10)
    FString Username;                                                                 // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FMultiplayerGetMatchRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    bool EscapeObject;                                                                // 0x0010 (size: 0x1)
    FString MatchId;                                                                  // 0x0018 (size: 0x10)
    FString QueueName;                                                                // 0x0028 (size: 0x10)
    bool ReturnMemberAttributes;                                                      // 0x0038 (size: 0x1)

}; // Size: 0x40

struct FMultiplayerGetMatchResult : public FPlayFabResultCommon
{
    FString MatchId;                                                                  // 0x0008 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Members;                                        // 0x0018 (size: 0x10)
    FString RegionPreferences;                                                        // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* ServerDetails;                                          // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FMultiplayerGetMatchmakingTicketRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    bool EscapeObject;                                                                // 0x0010 (size: 0x1)
    FString QueueName;                                                                // 0x0018 (size: 0x10)
    FString TicketId;                                                                 // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FMultiplayerGetMatchmakingTicketResult : public FPlayFabResultCommon
{
    FString CancellationReasonString;                                                 // 0x0008 (size: 0x10)
    FString Created;                                                                  // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* Creator;                                                // 0x0028 (size: 0x8)
    int32 GiveUpAfterSeconds;                                                         // 0x0030 (size: 0x4)
    FString MatchId;                                                                  // 0x0038 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Members;                                        // 0x0048 (size: 0x10)
    TArray<class UPlayFabJsonObject*> MembersToMatchWith;                             // 0x0058 (size: 0x10)
    FString QueueName;                                                                // 0x0068 (size: 0x10)
    FString Status;                                                                   // 0x0078 (size: 0x10)
    FString TicketId;                                                                 // 0x0088 (size: 0x10)

}; // Size: 0x98

struct FMultiplayerGetMultiplayerServerDetailsRequest : public FPlayFabRequestCommon
{
    FString BuildId;                                                                  // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    FString Region;                                                                   // 0x0020 (size: 0x10)
    FString SessionId;                                                                // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FMultiplayerGetMultiplayerServerDetailsResponse : public FPlayFabResultCommon
{
    FString BuildId;                                                                  // 0x0008 (size: 0x10)
    TArray<class UPlayFabJsonObject*> ConnectedPlayers;                               // 0x0018 (size: 0x10)
    FString FQDN;                                                                     // 0x0028 (size: 0x10)
    FString IPV4Address;                                                              // 0x0038 (size: 0x10)
    FString LastStateTransitionTime;                                                  // 0x0048 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Ports;                                          // 0x0058 (size: 0x10)
    FString Region;                                                                   // 0x0068 (size: 0x10)
    FString ServerId;                                                                 // 0x0078 (size: 0x10)
    FString SessionId;                                                                // 0x0088 (size: 0x10)
    FString State;                                                                    // 0x0098 (size: 0x10)
    FString VmId;                                                                     // 0x00A8 (size: 0x10)

}; // Size: 0xB8

struct FMultiplayerGetMultiplayerServerLogsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString ServerId;                                                                 // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FMultiplayerGetMultiplayerServerLogsResponse : public FPlayFabResultCommon
{
    FString LogDownloadUrl;                                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FMultiplayerGetMultiplayerSessionLogsBySessionIdRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString SessionId;                                                                // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FMultiplayerGetQueueStatisticsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString QueueName;                                                                // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FMultiplayerGetQueueStatisticsResult : public FPlayFabResultCommon
{
    int32 NumberOfPlayersMatching;                                                    // 0x0008 (size: 0x4)
    class UPlayFabJsonObject* TimeToMatchStatisticsInSeconds;                         // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FMultiplayerGetRemoteLoginEndpointRequest : public FPlayFabRequestCommon
{
    FString BuildId;                                                                  // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    FString Region;                                                                   // 0x0020 (size: 0x10)
    FString VmId;                                                                     // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FMultiplayerGetRemoteLoginEndpointResponse : public FPlayFabResultCommon
{
    FString IPV4Address;                                                              // 0x0008 (size: 0x10)
    int32 Port;                                                                       // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FMultiplayerGetServerBackfillTicketRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    bool EscapeObject;                                                                // 0x0010 (size: 0x1)
    FString QueueName;                                                                // 0x0018 (size: 0x10)
    FString TicketId;                                                                 // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FMultiplayerGetServerBackfillTicketResult : public FPlayFabResultCommon
{
    FString CancellationReasonString;                                                 // 0x0008 (size: 0x10)
    FString Created;                                                                  // 0x0018 (size: 0x10)
    int32 GiveUpAfterSeconds;                                                         // 0x0028 (size: 0x4)
    FString MatchId;                                                                  // 0x0030 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Members;                                        // 0x0040 (size: 0x10)
    FString QueueName;                                                                // 0x0050 (size: 0x10)
    class UPlayFabJsonObject* ServerDetails;                                          // 0x0060 (size: 0x8)
    FString Status;                                                                   // 0x0068 (size: 0x10)
    FString TicketId;                                                                 // 0x0078 (size: 0x10)

}; // Size: 0x88

struct FMultiplayerGetTitleEnabledForMultiplayerServersStatusRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FMultiplayerGetTitleEnabledForMultiplayerServersStatusResponse : public FPlayFabResultCommon
{
    ETitleMultiplayerServerEnabledStatus Status;                                      // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FMultiplayerGetTitleMultiplayerServersQuotaChangeRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString RequestId;                                                                // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FMultiplayerGetTitleMultiplayerServersQuotaChangeResponse : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Change;                                                 // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FMultiplayerGetTitleMultiplayerServersQuotasRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FMultiplayerGetTitleMultiplayerServersQuotasResponse : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Quotas;                                                 // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FMultiplayerJoinMatchmakingTicketRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Member;                                                 // 0x0010 (size: 0x8)
    FString QueueName;                                                                // 0x0018 (size: 0x10)
    FString TicketId;                                                                 // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FMultiplayerJoinMatchmakingTicketResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FMultiplayerListAssetSummariesRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    int32 PageSize;                                                                   // 0x0010 (size: 0x4)
    FString SkipToken;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FMultiplayerListAssetSummariesResponse : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> AssetSummaries;                                 // 0x0008 (size: 0x10)
    int32 PageSize;                                                                   // 0x0018 (size: 0x4)
    FString SkipToken;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FMultiplayerListBuildAliasesRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    int32 PageSize;                                                                   // 0x0010 (size: 0x4)
    FString SkipToken;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FMultiplayerListBuildAliasesResponse : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> BuildAliases;                                   // 0x0008 (size: 0x10)
    int32 PageSize;                                                                   // 0x0018 (size: 0x4)
    FString SkipToken;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FMultiplayerListBuildSummariesRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    int32 PageSize;                                                                   // 0x0010 (size: 0x4)
    FString SkipToken;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FMultiplayerListBuildSummariesResponse : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> BuildSummaries;                                 // 0x0008 (size: 0x10)
    int32 PageSize;                                                                   // 0x0018 (size: 0x4)
    FString SkipToken;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FMultiplayerListCertificateSummariesRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    int32 PageSize;                                                                   // 0x0010 (size: 0x4)
    FString SkipToken;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FMultiplayerListCertificateSummariesResponse : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> CertificateSummaries;                           // 0x0008 (size: 0x10)
    int32 PageSize;                                                                   // 0x0018 (size: 0x4)
    FString SkipToken;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FMultiplayerListContainerImageTagsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString ImageName;                                                                // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FMultiplayerListContainerImageTagsResponse : public FPlayFabResultCommon
{
    FString Tags;                                                                     // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FMultiplayerListContainerImagesRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    int32 PageSize;                                                                   // 0x0010 (size: 0x4)
    FString SkipToken;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FMultiplayerListContainerImagesResponse : public FPlayFabResultCommon
{
    FString Images;                                                                   // 0x0008 (size: 0x10)
    int32 PageSize;                                                                   // 0x0018 (size: 0x4)
    FString SkipToken;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FMultiplayerListMatchmakingTicketsForPlayerRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    FString QueueName;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FMultiplayerListMatchmakingTicketsForPlayerResult : public FPlayFabResultCommon
{
    FString TicketIds;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FMultiplayerListMultiplayerServersRequest : public FPlayFabRequestCommon
{
    FString BuildId;                                                                  // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    int32 PageSize;                                                                   // 0x0020 (size: 0x4)
    FString Region;                                                                   // 0x0028 (size: 0x10)
    FString SkipToken;                                                                // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FMultiplayerListMultiplayerServersResponse : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> MultiplayerServerSummaries;                     // 0x0008 (size: 0x10)
    int32 PageSize;                                                                   // 0x0018 (size: 0x4)
    FString SkipToken;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FMultiplayerListPartyQosServersRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FMultiplayerListPartyQosServersResponse : public FPlayFabResultCommon
{
    int32 PageSize;                                                                   // 0x0008 (size: 0x4)
    TArray<class UPlayFabJsonObject*> QosServers;                                     // 0x0010 (size: 0x10)
    FString SkipToken;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FMultiplayerListQosServersForTitleRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    bool IncludeAllRegions;                                                           // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FMultiplayerListQosServersForTitleResponse : public FPlayFabResultCommon
{
    int32 PageSize;                                                                   // 0x0008 (size: 0x4)
    TArray<class UPlayFabJsonObject*> QosServers;                                     // 0x0010 (size: 0x10)
    FString SkipToken;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FMultiplayerListServerBackfillTicketsForPlayerRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    FString QueueName;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FMultiplayerListServerBackfillTicketsForPlayerResult : public FPlayFabResultCommon
{
    FString TicketIds;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FMultiplayerListTitleMultiplayerServersQuotaChangesRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FMultiplayerListTitleMultiplayerServersQuotaChangesResponse : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Changes;                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FMultiplayerListVirtualMachineSummariesRequest : public FPlayFabRequestCommon
{
    FString BuildId;                                                                  // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    int32 PageSize;                                                                   // 0x0020 (size: 0x4)
    FString Region;                                                                   // 0x0028 (size: 0x10)
    FString SkipToken;                                                                // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FMultiplayerListVirtualMachineSummariesResponse : public FPlayFabResultCommon
{
    int32 PageSize;                                                                   // 0x0008 (size: 0x4)
    FString SkipToken;                                                                // 0x0010 (size: 0x10)
    TArray<class UPlayFabJsonObject*> VirtualMachines;                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FMultiplayerRequestMultiplayerServerRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* BuildAliasParams;                                       // 0x0008 (size: 0x8)
    FString BuildId;                                                                  // 0x0010 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0020 (size: 0x8)
    FString InitialPlayers;                                                           // 0x0028 (size: 0x10)
    FString PreferredRegions;                                                         // 0x0038 (size: 0x10)
    FString SessionCookie;                                                            // 0x0048 (size: 0x10)
    FString SessionId;                                                                // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FMultiplayerRequestMultiplayerServerResponse : public FPlayFabResultCommon
{
    FString BuildId;                                                                  // 0x0008 (size: 0x10)
    TArray<class UPlayFabJsonObject*> ConnectedPlayers;                               // 0x0018 (size: 0x10)
    FString FQDN;                                                                     // 0x0028 (size: 0x10)
    FString IPV4Address;                                                              // 0x0038 (size: 0x10)
    FString LastStateTransitionTime;                                                  // 0x0048 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Ports;                                          // 0x0058 (size: 0x10)
    FString Region;                                                                   // 0x0068 (size: 0x10)
    FString ServerId;                                                                 // 0x0078 (size: 0x10)
    FString SessionId;                                                                // 0x0088 (size: 0x10)
    FString State;                                                                    // 0x0098 (size: 0x10)
    FString VmId;                                                                     // 0x00A8 (size: 0x10)

}; // Size: 0xB8

struct FMultiplayerRolloverContainerRegistryCredentialsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FMultiplayerRolloverContainerRegistryCredentialsResponse : public FPlayFabResultCommon
{
    FString DnsName;                                                                  // 0x0008 (size: 0x10)
    FString Password;                                                                 // 0x0018 (size: 0x10)
    FString Username;                                                                 // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FMultiplayerShutdownMultiplayerServerRequest : public FPlayFabRequestCommon
{
    FString BuildId;                                                                  // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    FString Region;                                                                   // 0x0020 (size: 0x10)
    FString SessionId;                                                                // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FMultiplayerUntagContainerImageRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString ImageName;                                                                // 0x0010 (size: 0x10)
    FString Tag;                                                                      // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FMultiplayerUpdateBuildAliasRequest : public FPlayFabRequestCommon
{
    FString AliasId;                                                                  // 0x0008 (size: 0x10)
    FString AliasName;                                                                // 0x0018 (size: 0x10)
    TArray<class UPlayFabJsonObject*> BuildSelectionCriteria;                         // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FMultiplayerUpdateBuildNameRequest : public FPlayFabRequestCommon
{
    FString BuildId;                                                                  // 0x0008 (size: 0x10)
    FString BuildName;                                                                // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FMultiplayerUpdateBuildRegionRequest : public FPlayFabRequestCommon
{
    FString BuildId;                                                                  // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* BuildRegion;                                            // 0x0018 (size: 0x8)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FMultiplayerUpdateBuildRegionsRequest : public FPlayFabRequestCommon
{
    FString BuildId;                                                                  // 0x0008 (size: 0x10)
    TArray<class UPlayFabJsonObject*> BuildRegions;                                   // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FMultiplayerUploadCertificateRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* GameCertificate;                                        // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPlayFabBaseModel
{
    FPlayFabError responseError;                                                      // 0x0000 (size: 0x38)
    class UPlayFabJsonObject* responseData;                                           // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FPlayFabError
{
    bool HasError;                                                                    // 0x0000 (size: 0x1)
    int32 ErrorCode;                                                                  // 0x0004 (size: 0x4)
    FString ErrorName;                                                                // 0x0008 (size: 0x10)
    FString ErrorMessage;                                                             // 0x0018 (size: 0x10)
    FString ErrorDetails;                                                             // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FPlayFabLoginResultCommon : public FPlayFabResultCommon
{
    class UPlayFabAuthenticationContext* AuthenticationContext;                       // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPlayFabRequestCommon
{
    class UPlayFabAuthenticationContext* AuthenticationContext;                       // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPlayFabResultCommon
{
    class UPlayFabJsonObject* Request;                                                // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FProfilesGetEntityProfileRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    bool DataAsObject;                                                                // 0x0010 (size: 0x1)
    class UPlayFabJsonObject* Entity;                                                 // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FProfilesGetEntityProfileResponse : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* Profile;                                                // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FProfilesGetEntityProfilesRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    bool DataAsObject;                                                                // 0x0010 (size: 0x1)
    TArray<class UPlayFabJsonObject*> Entities;                                       // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FProfilesGetEntityProfilesResponse : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Profiles;                                       // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FProfilesGetGlobalPolicyRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FProfilesGetGlobalPolicyResponse : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Permissions;                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FProfilesGetTitlePlayersFromMasterPlayerAccountIdsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString MasterPlayerAccountIds;                                                   // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FProfilesGetTitlePlayersFromMasterPlayerAccountIdsResponse : public FPlayFabResultCommon
{
    FString TitleId;                                                                  // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* TitlePlayerAccounts;                                    // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FProfilesSetEntityProfilePolicyRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    TArray<class UPlayFabJsonObject*> Statements;                                     // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FProfilesSetEntityProfilePolicyResponse : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Permissions;                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FProfilesSetGlobalPolicyRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    TArray<class UPlayFabJsonObject*> Permissions;                                    // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FProfilesSetGlobalPolicyResponse : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FProfilesSetProfileLanguageRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* Entity;                                                 // 0x0010 (size: 0x8)
    int32 ExpectedVersion;                                                            // 0x0018 (size: 0x4)
    FString Language;                                                                 // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FProfilesSetProfileLanguageResponse : public FPlayFabResultCommon
{
    EOperationTypes OperationResult;                                                  // 0x0008 (size: 0x1)
    int32 VersionNumber;                                                              // 0x000C (size: 0x4)

}; // Size: 0x10

struct FServerAddCharacterVirtualCurrencyRequest : public FPlayFabRequestCommon
{
    int32 Amount;                                                                     // 0x0008 (size: 0x4)
    FString CharacterId;                                                              // 0x0010 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0020 (size: 0x8)
    FString PlayFabId;                                                                // 0x0028 (size: 0x10)
    FString VirtualCurrency;                                                          // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FServerAddFriendRequest : public FPlayFabRequestCommon
{
    FString FriendEmail;                                                              // 0x0008 (size: 0x10)
    FString FriendPlayFabId;                                                          // 0x0018 (size: 0x10)
    FString FriendTitleDisplayName;                                                   // 0x0028 (size: 0x10)
    FString FriendUsername;                                                           // 0x0038 (size: 0x10)
    FString PlayFabId;                                                                // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FServerAddGenericIDRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* GenericId;                                              // 0x0008 (size: 0x8)
    FString PlayFabId;                                                                // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FServerAddPlayerTagRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString PlayFabId;                                                                // 0x0010 (size: 0x10)
    FString TagName;                                                                  // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FServerAddPlayerTagResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FServerAddSharedGroupMembersRequest : public FPlayFabRequestCommon
{
    FString PlayFabIds;                                                               // 0x0008 (size: 0x10)
    FString SharedGroupId;                                                            // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FServerAddSharedGroupMembersResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FServerAddUserVirtualCurrencyRequest : public FPlayFabRequestCommon
{
    int32 Amount;                                                                     // 0x0008 (size: 0x4)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0010 (size: 0x8)
    FString PlayFabId;                                                                // 0x0018 (size: 0x10)
    FString VirtualCurrency;                                                          // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FServerAuthenticateSessionTicketRequest : public FPlayFabRequestCommon
{
    FString SessionTicket;                                                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerAuthenticateSessionTicketResult : public FPlayFabResultCommon
{
    bool IsSessionTicketExpired;                                                      // 0x0008 (size: 0x1)
    class UPlayFabJsonObject* UserInfo;                                               // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FServerAwardSteamAchievementRequest : public FPlayFabRequestCommon
{
    TArray<class UPlayFabJsonObject*> Achievements;                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerAwardSteamAchievementResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> AchievementResults;                             // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerBanUsersRequest : public FPlayFabRequestCommon
{
    TArray<class UPlayFabJsonObject*> Bans;                                           // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FServerBanUsersResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> BanData;                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerConsumeItemRequest : public FPlayFabRequestCommon
{
    FString CharacterId;                                                              // 0x0008 (size: 0x10)
    int32 ConsumeCount;                                                               // 0x0018 (size: 0x4)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0020 (size: 0x8)
    FString ItemInstanceId;                                                           // 0x0028 (size: 0x10)
    FString PlayFabId;                                                                // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FServerConsumeItemResult : public FPlayFabResultCommon
{
    FString ItemInstanceId;                                                           // 0x0008 (size: 0x10)
    int32 RemainingUses;                                                              // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FServerCreateSharedGroupRequest : public FPlayFabRequestCommon
{
    FString SharedGroupId;                                                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerCreateSharedGroupResult : public FPlayFabResultCommon
{
    FString SharedGroupId;                                                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerDeleteCharacterFromUserRequest : public FPlayFabRequestCommon
{
    FString CharacterId;                                                              // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    FString PlayFabId;                                                                // 0x0020 (size: 0x10)
    bool SaveCharacterInventory;                                                      // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FServerDeleteCharacterFromUserResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FServerDeletePlayerRequest : public FPlayFabRequestCommon
{
    FString PlayFabId;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerDeletePlayerResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FServerDeletePushNotificationTemplateRequest : public FPlayFabRequestCommon
{
    FString PushNotificationTemplateId;                                               // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerDeletePushNotificationTemplateResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FServerDeleteSharedGroupRequest : public FPlayFabRequestCommon
{
    FString SharedGroupId;                                                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerDeregisterGameRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString LobbyId;                                                                  // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FServerDeregisterGameResponse : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FServerEmptyResponse : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FServerEmptyResult : public FPlayFabResultCommon
{
}; // Size: 0x8

struct FServerEvaluateRandomResultTableRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    FString TableId;                                                                  // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FServerEvaluateRandomResultTableResult : public FPlayFabResultCommon
{
    FString ResultItemId;                                                             // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerExecuteCloudScriptResult : public FPlayFabResultCommon
{
    int32 APIRequestsIssued;                                                          // 0x0008 (size: 0x4)
    class UPlayFabJsonObject* Error;                                                  // 0x0010 (size: 0x8)
    int32 ExecutionTimeSeconds;                                                       // 0x0018 (size: 0x4)
    FString FunctionName;                                                             // 0x0020 (size: 0x10)
    class UPlayFabJsonObject* FunctionResult;                                         // 0x0030 (size: 0x8)
    bool FunctionResultTooLarge;                                                      // 0x0038 (size: 0x1)
    int32 HttpRequestsIssued;                                                         // 0x003C (size: 0x4)
    TArray<class UPlayFabJsonObject*> Logs;                                           // 0x0040 (size: 0x10)
    bool LogsTooLarge;                                                                // 0x0050 (size: 0x1)
    int32 MemoryConsumedBytes;                                                        // 0x0054 (size: 0x4)
    int32 ProcessorTimeSeconds;                                                       // 0x0058 (size: 0x4)
    int32 Revision;                                                                   // 0x005C (size: 0x4)

}; // Size: 0x60

struct FServerExecuteCloudScriptServerRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString FunctionName;                                                             // 0x0010 (size: 0x10)
    class UPlayFabJsonObject* FunctionParameter;                                      // 0x0020 (size: 0x8)
    bool GeneratePlayStreamEvent;                                                     // 0x0028 (size: 0x1)
    FString PlayFabId;                                                                // 0x0030 (size: 0x10)
    ECloudScriptRevisionOption RevisionSelection;                                     // 0x0040 (size: 0x1)
    int32 SpecificRevision;                                                           // 0x0044 (size: 0x4)

}; // Size: 0x48

struct FServerGetAllSegmentsRequest : public FPlayFabRequestCommon
{
}; // Size: 0x8

struct FServerGetAllSegmentsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Segments;                                       // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetCatalogItemsRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetCatalogItemsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Catalog;                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetCharacterDataRequest : public FPlayFabRequestCommon
{
    FString CharacterId;                                                              // 0x0008 (size: 0x10)
    int32 IfChangedFromDataVersion;                                                   // 0x0018 (size: 0x4)
    FString Keys;                                                                     // 0x0020 (size: 0x10)
    FString PlayFabId;                                                                // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FServerGetCharacterDataResult : public FPlayFabResultCommon
{
    FString CharacterId;                                                              // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* Data;                                                   // 0x0018 (size: 0x8)
    int32 DataVersion;                                                                // 0x0020 (size: 0x4)
    FString PlayFabId;                                                                // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FServerGetCharacterInventoryRequest : public FPlayFabRequestCommon
{
    FString CatalogVersion;                                                           // 0x0008 (size: 0x10)
    FString CharacterId;                                                              // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0028 (size: 0x8)
    FString PlayFabId;                                                                // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FServerGetCharacterInventoryResult : public FPlayFabResultCommon
{
    FString CharacterId;                                                              // 0x0008 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Inventory;                                      // 0x0018 (size: 0x10)
    FString PlayFabId;                                                                // 0x0028 (size: 0x10)
    class UPlayFabJsonObject* VirtualCurrency;                                        // 0x0038 (size: 0x8)
    class UPlayFabJsonObject* VirtualCurrencyRechargeTimes;                           // 0x0040 (size: 0x8)

}; // Size: 0x48

struct FServerGetCharacterLeaderboardRequest : public FPlayFabRequestCommon
{
    FString CharacterType;                                                            // 0x0008 (size: 0x10)
    int32 MaxResultsCount;                                                            // 0x0018 (size: 0x4)
    int32 StartPosition;                                                              // 0x001C (size: 0x4)
    FString StatisticName;                                                            // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FServerGetCharacterLeaderboardResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Leaderboard;                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetCharacterStatisticsRequest : public FPlayFabRequestCommon
{
    FString CharacterId;                                                              // 0x0008 (size: 0x10)
    FString PlayFabId;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FServerGetCharacterStatisticsResult : public FPlayFabResultCommon
{
    FString CharacterId;                                                              // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CharacterStatistics;                                    // 0x0018 (size: 0x8)
    FString PlayFabId;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FServerGetContentDownloadUrlRequest : public FPlayFabRequestCommon
{
    FString HttpMethod;                                                               // 0x0008 (size: 0x10)
    FString Key;                                                                      // 0x0018 (size: 0x10)
    bool ThruCDN;                                                                     // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FServerGetContentDownloadUrlResult : public FPlayFabResultCommon
{
    FString URL;                                                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetFriendLeaderboardRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    bool IncludeFacebookFriends;                                                      // 0x0010 (size: 0x1)
    bool IncludeSteamFriends;                                                         // 0x0011 (size: 0x1)
    int32 MaxResultsCount;                                                            // 0x0014 (size: 0x4)
    FString PlayFabId;                                                                // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* ProfileConstraints;                                     // 0x0028 (size: 0x8)
    int32 StartPosition;                                                              // 0x0030 (size: 0x4)
    FString StatisticName;                                                            // 0x0038 (size: 0x10)
    bool UseSpecificVersion;                                                          // 0x0048 (size: 0x1)
    int32 Version;                                                                    // 0x004C (size: 0x4)
    FString XboxToken;                                                                // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FServerGetFriendsListRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    bool IncludeFacebookFriends;                                                      // 0x0010 (size: 0x1)
    bool IncludeSteamFriends;                                                         // 0x0011 (size: 0x1)
    FString PlayFabId;                                                                // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* ProfileConstraints;                                     // 0x0028 (size: 0x8)
    FString XboxToken;                                                                // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FServerGetFriendsListResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Friends;                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetLeaderboardAroundCharacterRequest : public FPlayFabRequestCommon
{
    FString CharacterId;                                                              // 0x0008 (size: 0x10)
    FString CharacterType;                                                            // 0x0018 (size: 0x10)
    int32 MaxResultsCount;                                                            // 0x0028 (size: 0x4)
    FString PlayFabId;                                                                // 0x0030 (size: 0x10)
    FString StatisticName;                                                            // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FServerGetLeaderboardAroundCharacterResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Leaderboard;                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetLeaderboardAroundUserRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    int32 MaxResultsCount;                                                            // 0x0010 (size: 0x4)
    FString PlayFabId;                                                                // 0x0018 (size: 0x10)
    class UPlayFabJsonObject* ProfileConstraints;                                     // 0x0028 (size: 0x8)
    FString StatisticName;                                                            // 0x0030 (size: 0x10)
    bool UseSpecificVersion;                                                          // 0x0040 (size: 0x1)
    int32 Version;                                                                    // 0x0044 (size: 0x4)

}; // Size: 0x48

struct FServerGetLeaderboardAroundUserResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Leaderboard;                                    // 0x0008 (size: 0x10)
    FString NextReset;                                                                // 0x0018 (size: 0x10)
    int32 Version;                                                                    // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FServerGetLeaderboardForUsersCharactersRequest : public FPlayFabRequestCommon
{
    int32 MaxResultsCount;                                                            // 0x0008 (size: 0x4)
    FString PlayFabId;                                                                // 0x0010 (size: 0x10)
    FString StatisticName;                                                            // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FServerGetLeaderboardForUsersCharactersResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Leaderboard;                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetLeaderboardRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    int32 MaxResultsCount;                                                            // 0x0010 (size: 0x4)
    class UPlayFabJsonObject* ProfileConstraints;                                     // 0x0018 (size: 0x8)
    int32 StartPosition;                                                              // 0x0020 (size: 0x4)
    FString StatisticName;                                                            // 0x0028 (size: 0x10)
    bool UseSpecificVersion;                                                          // 0x0038 (size: 0x1)
    int32 Version;                                                                    // 0x003C (size: 0x4)

}; // Size: 0x40

struct FServerGetLeaderboardResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Leaderboard;                                    // 0x0008 (size: 0x10)
    FString NextReset;                                                                // 0x0018 (size: 0x10)
    int32 Version;                                                                    // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FServerGetPlayFabIDsFromFacebookIDsRequest : public FPlayFabRequestCommon
{
    FString FacebookIDs;                                                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetPlayFabIDsFromFacebookIDsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Data;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetPlayFabIDsFromFacebookInstantGamesIdsRequest : public FPlayFabRequestCommon
{
    FString FacebookInstantGamesIds;                                                  // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetPlayFabIDsFromFacebookInstantGamesIdsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Data;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetPlayFabIDsFromGenericIDsRequest : public FPlayFabRequestCommon
{
    TArray<class UPlayFabJsonObject*> GenericIDs;                                     // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetPlayFabIDsFromGenericIDsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Data;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetPlayFabIDsFromNintendoSwitchDeviceIdsRequest : public FPlayFabRequestCommon
{
    FString NintendoSwitchDeviceIds;                                                  // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetPlayFabIDsFromNintendoSwitchDeviceIdsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Data;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetPlayFabIDsFromPSNAccountIDsRequest : public FPlayFabRequestCommon
{
    int32 IssuerId;                                                                   // 0x0008 (size: 0x4)
    FString PSNAccountIDs;                                                            // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FServerGetPlayFabIDsFromPSNAccountIDsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Data;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetPlayFabIDsFromSteamIDsRequest : public FPlayFabRequestCommon
{
    FString SteamStringIDs;                                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetPlayFabIDsFromSteamIDsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Data;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetPlayFabIDsFromXboxLiveIDsRequest : public FPlayFabRequestCommon
{
    FString Sandbox;                                                                  // 0x0008 (size: 0x10)
    FString XboxLiveAccountIDs;                                                       // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FServerGetPlayFabIDsFromXboxLiveIDsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Data;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetPlayerCombinedInfoRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    class UPlayFabJsonObject* InfoRequestParameters;                                  // 0x0010 (size: 0x8)
    FString PlayFabId;                                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FServerGetPlayerCombinedInfoResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* InfoResultPayload;                                      // 0x0008 (size: 0x8)
    FString PlayFabId;                                                                // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FServerGetPlayerProfileRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString PlayFabId;                                                                // 0x0010 (size: 0x10)
    class UPlayFabJsonObject* ProfileConstraints;                                     // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FServerGetPlayerProfileResult : public FPlayFabResultCommon
{
    class UPlayFabJsonObject* PlayerProfile;                                          // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FServerGetPlayerSegmentsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> Segments;                                       // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetPlayerStatisticVersionsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString StatisticName;                                                            // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FServerGetPlayerStatisticVersionsResult : public FPlayFabResultCommon
{
    TArray<class UPlayFabJsonObject*> StatisticVersions;                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FServerGetPlayerStatisticsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString PlayFabId;                                                                // 0x0010 (size: 0x10)
    FString StatisticNames;                                                           // 0x0020 (size: 0x10)
    TArray<class UPlayFabJsonObject*> StatisticNameVersions;                          // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FServerGetPlayerStatisticsResult : public FPlayFabResultCommon
{
    FString PlayFabId;                                                                // 0x0008 (size: 0x10)
    TArray<class UPlayFabJsonObject*> Statistics;                                     // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FServerGetPlayerTagsRequest : public FPlayFabRequestCommon
{
    class UPlayFabJsonObject* CustomTags;                                             // 0x0008 (size: 0x8)
    FString Namespace;                                                                // 0x0010 (size: 0x10)
    FString PlayFabId;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FServerGetPlayerTagsResult : public FPlayFabResultCommon
{
    FString PlayFabId;                                                                // 0x0008 (size: 0x10)
    FString Tags;                                                                     // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FServerGetPlayersInSegmentRequest : public FPlayFabRequestCommon
{
    FString ContinuationToken;                                                        // 0x0008 (size: 0x10)
    class UPlayFabJsonObject* CustomTags;                                             // 0x0018 (size: 0x8)
    int32 MaxBatchSize;                                                               // 0x0020 (size: 0x4)
    int32 SecondsToLive;                                                              // 0x0024 (size: 0x4)
