#ifndef UE4SS_SDK_UE4ASP_HeroTPP_AnimBlueprint_HPP
#define UE4SS_SDK_UE4ASP_HeroTPP_AnimBlueprint_HPP

class UUE4ASP_HeroTPP_AnimBlueprint_C : public UAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x02C0 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x02C8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x02F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x0320 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x0348 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x0370 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x0398 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x03C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x03E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x0410 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x0438 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x0460 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x0488 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x04B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x04D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x0500 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x0528 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x0550 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x0578 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x05A0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x05C8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x0648 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x0678 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x06F8 (size: 0x30)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x0728 (size: 0xE8)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x0810 (size: 0x30)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x0840 (size: 0xE8)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x0928 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x0958 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x09D8 (size: 0x30)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x0A08 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x0AA8 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x0B28 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x0BA8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x0BD8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x0C58 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x0C88 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x0D08 (size: 0x30)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x0D38 (size: 0xE8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x0E20 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x0EA0 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x0F40 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x0F70 (size: 0xB0)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x1020 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x1068 (size: 0xC0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x1128 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x1280 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x12A8 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x12D0 (size: 0xE8)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x13B8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x13E8 (size: 0xB0)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x1498 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x1560 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x15A8 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x1648 (size: 0x80)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x16C8 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x16E8 (size: 0x108)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x17F0 (size: 0x20)
    float Speed;                                                                      // 0x1810 (size: 0x4)
    float Direction;                                                                  // 0x1814 (size: 0x4)
    bool IsJumping;                                                                   // 0x1818 (size: 0x1)
    bool IsInLandingPhase;                                                            // 0x1819 (size: 0x1)
    bool Crouching;                                                                   // 0x181A (size: 0x1)
    bool IsAiming;                                                                    // 0x181B (size: 0x1)
    bool IsMelee;                                                                     // 0x181C (size: 0x1)
    class UAnimSequenceBase* Melee_Jog_Anim;                                          // 0x1820 (size: 0x8)
    FRotator ControllRotation;                                                        // 0x1828 (size: 0xC)
    bool IsAlive;                                                                     // 0x1834 (size: 0x1)
    int32 DeathAnim;                                                                  // 0x1838 (size: 0x4)
    FVector Effector Location;                                                        // 0x183C (size: 0xC)
    bool IsStunned;                                                                   // 0x1848 (size: 0x1)

    void AnimGraph(FPoseLink& AnimGraph);
    void Can Jump(bool Should Jump, bool& bJumping);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4ASP_HeroTPP_AnimBlueprint_AnimGraphNode_ModifyBone_7BC8FF6B4394B85D0E7ED3A29733C0B2();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4ASP_HeroTPP_AnimBlueprint_AnimGraphNode_TransitionResult_C6666241479C7F5F33D80CA54B21A5BA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4ASP_HeroTPP_AnimBlueprint_AnimGraphNode_TransitionResult_D25429B644E6C66D625827BA5AE5F04E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4ASP_HeroTPP_AnimBlueprint_AnimGraphNode_TransitionResult_315E9BF04EA579C328EB6A866B91C07A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4ASP_HeroTPP_AnimBlueprint_AnimGraphNode_TransitionResult_811063F14E6090213BFC468961C60E28();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4ASP_HeroTPP_AnimBlueprint_AnimGraphNode_TransitionResult_5540D45C4BCA55AEC05DA1A1E21BFB58();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4ASP_HeroTPP_AnimBlueprint_AnimGraphNode_TransitionResult_D3AC63D34B69210FE0B1D4BB1AC79BED();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4ASP_HeroTPP_AnimBlueprint_AnimGraphNode_TransitionResult_F43CB535410579D210A422A04676FD2A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4ASP_HeroTPP_AnimBlueprint_AnimGraphNode_TransitionResult_23C30FC54F432C27A8D2E086D1A0B4F4();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4ASP_HeroTPP_AnimBlueprint_AnimGraphNode_TransitionResult_F13AB6764EBE8335385B039A555B9993();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4ASP_HeroTPP_AnimBlueprint_AnimGraphNode_TransitionResult_4AAD4A594EABD4F92E1D44BBD3F4830B();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void AnimNotify_Jump();
    void AnimNotify_IdleStart();
    void AnimNotify_JogStart();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_UE4ASP_HeroTPP_AnimBlueprint_AnimGraphNode_TransitionResult_4C235A41480DCEDADE563BB181725CEF();
    void BlueprintBeginPlay();
    void ExecuteUbergraph_UE4ASP_HeroTPP_AnimBlueprint(int32 EntryPoint);
}; // Size: 0x1849

#endif
