#ifndef UE4SS_SDK_UMG_HintsPanel_HPP
#define UE4SS_SDK_UMG_HintsPanel_HPP

class UUMG_HintsPanel_C : public UUserWidget
{
    class UImage* Image;                                                              // 0x0260 (size: 0x8)
    class UImage* Image_1;                                                            // 0x0268 (size: 0x8)
    class UImage* Image_2;                                                            // 0x0270 (size: 0x8)
    class UImage* Image_120;                                                          // 0x0278 (size: 0x8)
    class UImage* Image_327;                                                          // 0x0280 (size: 0x8)
    class UUMG_ColoredCategory_C* UMG_ColoredCategory;                                // 0x0288 (size: 0x8)
    class UUMG_ColoredCategory_C* UMG_ColoredCategory_275;                            // 0x0290 (size: 0x8)
    class UUMG_ColoredCategory_C* UMG_ColoredCategory_879;                            // 0x0298 (size: 0x8)
    class UUMG_ColoredCategory_C* UMG_ColoredCategory_1108;                           // 0x02A0 (size: 0x8)
    class UUMG_ColoredCategory_C* UMG_ColoredCategory_1289;                           // 0x02A8 (size: 0x8)
    class UUMG_ColoredCategory_C* UMG_ColoredCategory_1426;                           // 0x02B0 (size: 0x8)
    class UUMG_IconWithText_C* UMG_IconWithText;                                      // 0x02B8 (size: 0x8)
    class UUMG_IconWithText_C* UMG_IconWithText_1;                                    // 0x02C0 (size: 0x8)
    class UUMG_IconWithText_C* UMG_IconWithText_2;                                    // 0x02C8 (size: 0x8)
    class UUMG_IconWithText_C* UMG_IconWithText_3;                                    // 0x02D0 (size: 0x8)
    class UUMG_IconWithText_C* UMG_IconWithText_4;                                    // 0x02D8 (size: 0x8)
    class UUMG_IconWithText_C* UMG_IconWithText_5;                                    // 0x02E0 (size: 0x8)
    class UUMG_IconWithText_C* UMG_IconWithText_6;                                    // 0x02E8 (size: 0x8)
    class UUMG_IconWithText_C* UMG_IconWithText_7;                                    // 0x02F0 (size: 0x8)
    class UUMG_IconWithText_C* UMG_IconWithText_8;                                    // 0x02F8 (size: 0x8)
    class UUMG_IconWithText_C* UMG_IconWithText_13;                                   // 0x0300 (size: 0x8)
    class UUMG_IconWithText_C* UMG_IconWithText_14;                                   // 0x0308 (size: 0x8)
    class UUMG_IconWithText_C* UMG_IconWithText_15;                                   // 0x0310 (size: 0x8)
    class UUMG_IconWithText_C* UMG_IconWithText_16;                                   // 0x0318 (size: 0x8)

}; // Size: 0x320

#endif
